[
  {
    "date": "2025-05-29",
    "headline": "Corporate citizenship | TI.com",
    "content": "Corporate citizenship\nOur commitment to operate in a socially thoughtful and environmentally responsible manner.\nOur commitment to corporate citizenship\nWe take pride in our commitment to being a good corporate citizen – including environmental, social and governance priorities – and our commitment to citizenship directly relates to our passion to create a better world by making electronics more affordable through semiconductors.\nWith our ambitions guiding our decision making for the long-term and our products helping to create a better world, we are confident that our collective efforts will be impactful and long lasting.\nReducing our environmental impact\nWe take great pride in being a good corporate citizen and have a long-standing commitment to responsible, sustainable manufacturing. We produced our first Corporate Citizenship Report in 2006, and we remain committed to our long-term environmental sustainability programs of conserving natural resources, reducing greenhouse gas (GHG) emissions and mitigating climate change.\nLearn more about environmental sustainability\nCreating a better world\nAs engineers, we are fortunate to work on exciting technology that helps our customers innovate to create a better world. Our semiconductor products are powering sustainable technology around the world, such as electric vehicles and renewable energy applications, and helping to make a positive impact in a growing number of ways.\nEnsuring a responsible supply chain\nOur ambitions and core values are integral to building a stronger company, and every TIer plays a critical role in upholding these principles and driving sustainable and responsible business practices throughout our supply chain, from policies and strategies related to environmental and social responsibility across our supply chain, to the responsible sourcing of minerals for our products.\nBuilding stronger communities\nOne of our three ambitions is to be a company that we’re personally proud to be a part of and would want as our neighbor. For decades, TI and the TI Foundation have worked to build stronger communities where the company operates. And our employees are equally passionate about giving back and improving the quality of life in their communities.\nWorking at TI\nWe bring together 34,000 of the world’s smartest people – problem solvers known simply as TIers – who are committed to shaping the future of electronics in an environment in which every person can thrive.",
    "article_url": "https://www.ti.com/about-ti.html",
    "source_url": "https://www.ti.com/about-ti/newsroom/news-releases/2024/2024-10-24-texas-instruments-expands-internal-manufacturing-for-gallium-nitride--gan--semiconductors--quadrupling-capacity.html"
  },
  {
    "date": "2024-12-20",
    "headline": "Texas Instruments announces award agreement for CHIPS and Science Act funding",
    "content": "Texas Instruments announces award agreement for CHIPS and Science Act funding\nUp to $1.6 billion in direct funding supports TI's semiconductor manufacturing expansions in Texas and Utah\nNEWS HIGHLIGHTS:\n- The U.S. Department of Commerce has awarded TI up to $1.6 billion in CHIPS Act funding to support three new 300mm semiconductor wafer fabs under construction in Texas and Utah.\n- TI also expects to receive an estimated $6 billion to $8 billion from the U.S. Department of the Treasury's Investment Tax Credit for qualified U.S. manufacturing investments.\n- The company will also receive up to $10 million to support workforce development.\nLEHI, Utah and SHERMAN, Texas, Dec. 20, 2024 /PRNewswire/ -- Texas Instruments (TI) (Nasdaq: TXN) and the U.S. Department of Commerce today announced an award agreement of up to $1.6 billion in direct funding through the U.S. CHIPS and Science Act, following the preliminary memorandum of terms announced in August 2024. The funding will help support three of TI's new 300mm wafer fabs currently under construction in Texas and Utah. Support from the CHIPS Act, including the 25% investment tax credit, will help TI provide a geopolitically dependable supply of essential analog and embedded processing semiconductors.\n\"As the largest analog and embedded processing semiconductor manufacturer in the U.S., TI is uniquely positioned to provide dependable, low-cost 300mm semiconductor manufacturing capacity at scale,\" said Haviv Ilan, president and CEO of Texas Instruments. \"The increasing number of electronic devices in our lives depend on our foundational chips, and we appreciate the support from the U.S. government to make the semiconductor ecosystem stronger and more resilient.\"\nThe CHIPS Act direct funding will support TI's investments through 2029 for three large-scale 300mm wafer fabs in Sherman, Texas (SM1 and SM2), and Lehi, Utah (LFAB2). Together, these fabs will manufacture tens of millions of analog and embedded processing chips every day that are critical to a variety of end markets, including automotive, industrial, personal electronics, communications equipment and enterprise systems.\nSpecifically, the CHIPS Act direct funding will be distributed upon completion of project milestones, supporting:\n- Cleanroom construction and tool installations at SM1 in Sherman, Texas;\n- Shell construction of SM2, a second fab in Sherman, Texas; and\n- Cleanroom construction and tool installations at LFAB2, a second fab in Lehi, Utah.\nThese connected, multi-fab sites in Texas and Utah will benefit from shared infrastructure, talent and technology sharing, and a strong network of existing suppliers and community partners.\nCombined, TI's three new fabs in Texas and Utah will create 2,000 company jobs, along with thousands of indirect jobs for construction, suppliers and supporting industries. TI is also investing in building its future workforce. As part of the CHIPS Act award agreement, TI will also receive up to $10 million for workplace development efforts in Texas and Utah.\nConsistent with TI's longstanding commitment to responsible, sustainable manufacturing and environmental stewardship, the company's 300mm wafer fabs will be entirely powered by renewable electricity. Additionally, TI is committed to reducing overall water consumption across its operations, endeavoring to achieve a 70% water reuse capability in Sherman, Texas, and Lehi, Utah. All of TI's new 300mm fabs are also designed to meet LEED Gold standards for structural efficiency and sustainability.\nLearn more:\n- TI CHIPS Act press kit (includes images, video b-roll, fact sheet)\n- TI Sherman, Texas, press kit\n- TI Lehi, Utah, press kit\nNotice regarding forward-looking statements\nThis release includes forward-looking statements intended to qualify for the safe harbor from liability established by the Private Securities Litigation Reform Act of 1995. These forward-looking statements generally can be identified by phrases such as TI or its management \"believes,\" \"expects,\" \"anticipates,\" \"foresees,\" \"forecasts,\" \"estimates\" or other words or phrases of similar import. Similarly, statements herein that describe TI's business strategy, outlook, objectives, plans, intentions or goals also are forward-looking statements. All such forward-looking statements are subject to certain risks and uncertainties that could cause actual results to differ materially from those in forward-looking statements.\nSee Item 1A of TI's most recent Form 10-K for a detailed discussion of risk factors that could cause results to differ materially from the forward-looking statements. The forward-looking statements included in this release are made only as of the date of this release, and we undertake no obligation to update the forward-looking statements to reflect subsequent events or circumstances. If we do update any forward-looking statement, you should not infer that we will make additional updates with respect to that statement or any other forward-looking statement.\nAbout Texas Instruments\nTexas Instruments Incorporated (Nasdaq: TXN) is a global semiconductor company that designs, manufactures, and sells analog and embedded processing chips for markets such as industrial, automotive, personal electronics, communications equipment and enterprise systems. At our core, we have a passion to create a better world by making electronics more affordable through semiconductors. This passion is alive today as each generation of innovation builds upon the last to make our technology more reliable, more affordable and lower power, making it possible for semiconductors to go into electronics everywhere. Learn more at TI.com.\nSOURCE Texas Instruments",
    "article_url": "https://www.ti.com/about-ti/newsroom/news-releases/2024/2024-12-20-texas-instruments-announces-award-agreement-for-chips-and-science-act-funding.html",
    "source_url": "https://www.ti.com/about-ti/newsroom/news-releases/2024/2024-10-24-texas-instruments-expands-internal-manufacturing-for-gallium-nitride--gan--semiconductors--quadrupling-capacity.html"
  },
  {
    "date": "2024-09-27",
    "headline": "News releases",
    "content": "Reporters and editors can contact TI’s media relations team at: mediarelations@ti.com To contact another group at TI, please visit the TI Contact Us page.",
    "article_url": "https://www.ti.com/about-ti/newsroom/news-releases.html",
    "source_url": "https://www.ti.com/about-ti/newsroom/news-releases/2024/2024-10-24-texas-instruments-expands-internal-manufacturing-for-gallium-nitride--gan--semiconductors--quadrupling-capacity.html"
  },
  {
    "date": "2025-05-30",
    "headline": "How can we help you?",
    "content": "Please note that technical support is not available through our office locations. For help and information requests, please choose one of these options.\nDesign support\nOur product applications engineers answer semiconductor design questions on the TI E2E™ design support forums, where you can search previously answered questions or ask a new question.\nOther support questions\nFor non-design-related questions such as ordering semiconductor parts and tools, contact our customer support center where you can open a support ticket, chat with us 24 hours a day, Monday through Friday; or call the TI support team.\nCalculator and education products\nContact our TI-Cares™ customer support team for questions regarding our calculators and education products.\nSuppliers\nUse the information and resources on this site to help you understand and meet our supplier expectations.\nMedia contacts\nReach out to one of our media relations representatives to get the right information for your story.\nStrategic partnerships\nFind information about startups, early stage companies and entrepreneurs working in the semiconductor space.\nTI ethics helpline\nReport concerns or ask questions to the Texas Instruments Ethics and Compliance Office. For support questions, please see contact information above.\nContact the TI support team\n| English | U.S.: +1-855-226-3113 | 24 hours a day, |\nLocal language support is available during the hours listed below. Support in English is also available from the local numbers below 24 hours a day, Monday through Friday.\n| Mandarin | +86-40-0819-8694 | Monday-Friday, |\n| Japanese | +81-3-6634-4911 | Monday-Friday, |\n| Korean | +82-70-766-32297 | Monday-Friday, |\n| German | +49-30-91589890 | Monday-Friday, |\n| Italian | +39-069-974-8075 | Monday-Friday, |\n| French | +33-1-85-14-98-29 | Monday-Friday, |\n| Spanish | +34-912-158-166 | Monday-Friday, |\nLocations\nExecutive offices: 12500 TI Blvd., Dallas, Texas 75243 USA\nMailing address: P.O. Box 660199, Dallas, Texas 75266-0199\nMain directory phone number: 972-995-2011\nTI worldwide offices: See the mailing and physical addresses for our regional business offices are listed below. These offices are unable to answer technical product questions, unfortunately.\nChina\nTexas Instruments Semiconductor Technologies (Shanghai) Co., Ltd.\n德州仪器半导体技术（上海）有限公司\nBeijing Branch 北京分公司\n6F Raycom Info Tech Park-C South, No.2, Kexueyuan South Road, Haidian District, Beijing, P.R.China\n邮编: 100190\n北京市海淀区科学院南路2号融科资讯中心 C 座南楼 6 层\nChangsha branch 长沙分公司\nRoom 1151,11 Floor, Regus Huayuan Center, No. 36 Xiangjiang Mid. Road,\nTianxin District Changsha, Hunan Province, P.R. China, 410016\n邮编: 410016\n湖南省长沙市天心区湘江中路36号华远国际中心 11 楼雷格斯商务中心 1151 室\nChengdu Branch 成都分公司\n10F, E2 Tower, 1268 Tianfu Avenue, Tianfu Software Park\nChengdu, 610015, Sichuan Province, P.R. China\n1邮编: 610041\n四川省成都市高新区天府大道中段1268号天府软件园E区E2座10层\nDongguan Branch 东莞分公司\nRoom 103,Xinzhu Yuan No. 6 Building, No.4 Xinzhu Road, Song Shan Lake Science Park\nDongguan, Guangdong Province, P.R.China\n邮编: 523808\n东莞市松山湖科技产业园区新竹路4号新竹苑 6 幢办公楼 103 室\nGuangzhou Branch 广州分公司\nRoom 3502-2，3503-1，3508-2, Center Plaza,161 Linhexi Road, Tianhe District\nGuangzhou 510620, Guangdong Province, P. R. China\n邮编: 510620\n广东省广州市天河区林和西路161号中泰国际广场写字楼35层3502-2，3503-1，3508-2\nHangzhou Branch 杭州分公司\nRoom 809, 8th Floor, C building, Ping’an banking center, No.280 Minxin Street, Shangcheng District, Hangzhou\n邮编: 310020\n浙江省杭州市上城区民心路280号平安金融中心 C 幢 809 室\nNanjing Branch 南京分公司\nUnit 08-10, 8F , Buliding A, Shimaochengpin International Square, NO.52 Andemen Street, Yuhuatai District,\nNanjing 210012, Jiangsu Province, P. R. China\n邮编: 210012\n江苏省南京市雨花台区安德门大街52号世茂城品国际广场 A 栋第 8层 8-10 号\nQingdao Branch 青岛分公司\nUnit 605, Qingdao Shangshi Center, No.3 building, East Hong Kong road, Laoshan District\nQingdao 266061, Shandong Province, P.R. China\n邮编: 266061\n山东省青岛市崂山区香港东路 195 号 3 号楼青岛上实中心 605 单元\nShanghai Branch 上海分公司\n10th Floor, New Bund Center, No.555 Haiyang Xi Road, Pudong New Area, Shanghai,200126, P. R. China\n邮编: 200126\n上海市浦东新区海阳西路 555 号前滩中心 10 层\nShanghai R&D Center 上海R&D 中心\n2/F NO. 72 Liangxiu Road\nPudong New Area, Shanghai, 201203\n邮编: 201203\n上海市浦东新区亮秀路72号2层\nShenzhen Branch 深圳分公司\n16th and 17th floor, Building T8, Qian Hai Kerry Business Center, Qianhai Shenzhen-Hongkong Cooperation Zone, Shenzhen\n邮编：518052\n深圳市前海深港合作区前海嘉里商务中心 T8 栋 16 楼 - 17 楼\nSuzhou Branch 苏州分公司\nUnit 1509-1510, 15F Genway Tower,No.188 Wangdun Road, Suzhou Industrial Park\nSuzhou 215123, Jiangsu Province, P.R.China\n邮编: 215123\n江苏省苏州工业园区旺墩路口188号建屋大厦15楼1509-1510室\nWuhan Branch 武汉分公司\nUnit 04, Floor 19, mTower, No. 355 Guanshan Avenue, East Lake High-tech Development Zone, Wuhan, Hubei Province. 430074\n地址：武汉市东湖新技术开发区关山大道 355 号铭丰大厦 19 层 4 单\n邮政编码：430074\nXi'an Branch 西安分公司\nRoom 1302, Yongli International Financial Center\nNo.6 Jin Ye 1st Road, Hi-tech Area\nXi'an, Shanxi Province, P.R. China\n地址：陕西省西安市高新区锦业一路6号永利国际金融中心13层1302室\nXiamen Branch 厦门分公司\nRoom 2802, The Bank Center, No. 189, Xia He Road\nXiamen 361003, Fujian Province, China PRC.\n邮编: 361003\n福建省厦门市厦禾路189号银行中心2802室\nZhuhai Branch 珠海分公司\nUnit 04A, 17/F, China Overseas Building Tower B, No.2023 West of Jiushou Ave., Xiangzhou Dist., Zhuhai. 519070\nGuangdong Province P.R. China\n邮编: 519070\n珠海市香洲区九洲大道2023号富华里B栋1704A\nTexas Instruments Hong Kong Limited\n德州仪器香港有限公司\nRoom 126, 17F, Tower 1, Grand Century Place, 193 Prince Edward Rd W, Mongkok, HK\n香港九龍旺角太子道西 193 號新世紀廣場 1 座 17 樓 126 辦公室\nEurope, Middle East & Africa\nTexas Instruments Finland\nPorkkalankatu 22\n00180 Helsinki\nFinland\nTexas Instruments France\nNoda Building\n185-187 Quai de la Bataille de Stalingrad\n92130 Issy-les-Moulineaux\nFrance\nTexas Instruments Deutschland\nHaggertystrasse 1\n85356 Freising\nGermany\nTexas Instruments Israel\n26 Zarhin Street\n4366250 RA’ANANA\nIsrael\nTexas Instruments Italy\nQuartiere Torri Bianche, Palazzo Tiglio\nVia Torri Bianche 6\n20871 Vimercate MB\nItaly\nTexas Instruments Norway\nHoffsveien 70C\n0377 Olso\nNorway\nTexas Instruments Sweden\nKista Science Tower\nFärögatan 33\n164 51 Stockholm\nSweden\nTexas Instruments UK\nThe Royals\n353 Altrincham Road\nM22 4BJ Manchester\nUnited Kingdom\nTexas Instruments’ affiliates are present at 40 locations all across EMEA.\nEMEA Startup program TechMatch™\nTake product innovation to a new level and scale your business faster with our startup program.\nIndia\nBangalore (Head Office)\nBagmane Tech Park No. 66/3,\nAdjacent to LRDE Byrasandra, C V\nRaman Nagar Post Bangalore -\n560093 India\nNew Delhi\n2F, 2nd Floor, Uppal Plaza\nM6 Jasola Distt Center\nJasola, New DelhiINDIA 110025\nPune\n503 City bay, 5th Floor,\nBoat club road,\nSangamwadi, Pune-411001, India\nIndonesia\nJakarta\nTexas Instruments Indonesia Pte Ltd\nTempo Scan Tower,\n32 Floor, Jl. H. R. Rasuna Said,\nKav. 2-3, Jakarta 12950, Indonesia\nJapan\nTexas Instruments Japan Limited\n日本テキサス・インスツルメンツ合同会社\nTokyo (Head office) 東京本社\nShinagawa Season Terrace,1-2-70, Konan, Minato-kuTokyo 108-0075\n東京都港区港南1丁目2番70号品川シーズンテラス 〒108-0075\nAizu Factory 会津工場\n2 Takaku-Kogyodanchi, Aizuwakamatsu-shi, Fukushima, 965-0060\n〒965-0060\n福島県会津若松市高久工業団地 2 番\nHiji Packaging center 日出パッケージングセンター\n1357 Oga, Hayamigun Hiji-machi Oita, 879-1504\n〒879-1504\n大分県速見郡日出町大字大神1357\nMatsumoto Office 松本営業所\n6th floor Nihonseimei Matsumotoekimae building, 1-4-20 Chuo Matumoto-shi Nagano, 390-0811\n〒390-0811\n長野県松本市中央 1-4-20 日本生命松本駅前ビル 6階\nMiho Factory 美浦工場\n2350 Kihara, Mihomura Inashikigun Ibaraki, 300-0496\n〒300-0496\n茨城県稲敷郡美浦村木原 2350\nNagoya Office 名古屋営業所\n17th floor Nishiki park building, 2-4-3 Nishiki Naka-ku Nagoya-shi Aichi, 460-0003\n〒460-0003\n愛知県名古屋市中区錦 2-4-3 錦パークビル 17階\nOsaka Office 大阪営業所\n9th floor Shinosakadai 2 NK building, 4-5-41 Miyahara, Yodogawa-ku Osaka-shi Osaka, 532-0003\n〒532-0003\n大阪府大阪市淀川区宮原四丁目5番41号 新大阪第2NKビル ９階\nKorea\nSeoul (Head office)\nTexas Instruments Korea 31F Trade Tower, 511 Yeongdong-daero, Gangnam-gu, Seoul 06164 Korea\n텍사스 인스트루먼트 코리아 유한회사 서울 특별시 강남구 영동대로 511 (삼성동) 트레이드타워 31층 06164\nDaegu\nTexas Instruments Korea Ltd. 9F Daegu Trade Center, 489 Dongdaegu-ro, Dong-gu, Daegu, Korea\n텍사스 인스트루먼트 코리아 유한회사, 대구광역시 동구 동대구로 489 (신천동) 대구무역회관 9층\nSuwon\nTexas Instruments Korea Ltd. Suwon convention center 5F 512-514, 140, Gwanggyojungang-ro, Yeongtong-gu, Suwon, Korea\n텍사스 인스트루먼트 코리아 유한회사, 경기도 수원시 영통구 광교중앙로 140, 수원컨벤션센터 5층 512-514\nMexico\nMexico City\nAv Ejercito Nacional 216\nCol. Veronica Anzures\nCDMX, 11590\nPhilippines\nPasig City\n19F Regus Center, Marco Polo Ortigas Manila\nSapphire Road, Ortigas Center\nPasig City, 1600 Philippines\nSingapore\nSingapore\nTexas Instruments South East Asia Pte Ltd\n83 Clemenceau Avenue\n#18-05/07\nSingapore 239920\nTaiwan\n台北市\n10548 台北市松山區敦化北路 168 號 13 樓 (宏泰世界大樓)\n13F, No. 168, DunHua N. Road, Songshan District, Taipei City, 10548, Taiwan\n新竹\n302 新竹縣竹北市台元街 38 號 6 樓之 2\n6F-2, No.38, Taiyuan St., Jhubei City, HsinChu County, 302, Taiwan\n台中\n403 台中市忠明南路 497 號 19 樓之 2\n19F-2, No.497, Chung-Ming S. Road, Taichung City, 403, Taiwan\n台南\n711010 台南市歸仁區歸仁十三路一段 6 號 6 樓 618 室\nRoom 618, 6F, No. 6, Sec. 1, Guiren 13th Rd., Guiren Dist., Tainan City, 711010, Taiwan\nUnited States\nCalifornia - Santa Clara\n4555 Great America Parkway\nSanta Clara, CA 95054\nCalifornia - Irvine\n7700 Irvine Center Drive\nSuite 250\nIrvine, CA 92618\nCalifornia - Los Angeles\n5220 Pacific Concourse Drive\nSuite 340\nLos Angeles, CA 90045\nCalifornia - San Diego\n9276 Scranton Road\nSuite 450\nSan Diego, CA 92121\nColorado\n12303 Airport Way\nSuite 130\nBroomfield, CO 80021\nIllinois\n475 N. Martingale Road\nSuite 850\nSchaumburg, IL 60173\nMassachusetts\n200 5th Avenue\n6th Floor\nWaltham, MA 02451\nMichigan\n29777 Telegraph Road\nSuite 2500\nSouthfield, MI 48034\nTexas\n12357 Riata Trace Pkwy\nSuite A-130\nAustin, TX 78727\nUtah\n4000 Flash Drive\nLehi, UT 84043\nWashington state\n6244 185th Avenue NE\nSuite 200\nSeattle, WA 98052\nTexas Instruments is present in more than 25 offices across the United States. If you need to contact us in a location not listed above, please reach out to our customer support center.\nVietnam\nHo Chi Minh\nTI HCM: Crosscoop office center – Vincom, Unit 18, Floor 12A, 72 Le Thanh Ton street, District 1, HCM city, Vietnam\nVăn Phòng Texas Instruments HCM, CrossCoop, Lầu 12A, Tòa nhà Vincom, Số 72 Lê Thánh Tôn, Quận 1, TP. HCM\nPhone: +84 8 3528 5408\nEmail: tihcm.support@ti.com\nHanoi\nTI Hanoi: Regus Office Center, Room 1637, 16th Floor Daeha Building, 360 Kim Ma, Hanoi, Vietnam\nVăn Phòng Texas Instruments Hà Nội, Phòng 1637, Regus, Tầng 16 tòa nhà Daeha, 360 Kim Mã, Hà Nội.\nPhone: +84 4 3267 3485\nEmail: tihn.support@ti.com",
    "article_url": "https://www.ti.com/info/contact-us.html",
    "source_url": "https://www.ti.com/about-ti/newsroom/news-releases/2024/2024-10-24-texas-instruments-expands-internal-manufacturing-for-gallium-nitride--gan--semiconductors--quadrupling-capacity.html"
  },
  {
    "date": "2025-06-18",
    "headline": "Texas Instruments plans to invest more than $60 billion to manufacture billions of foundational semiconductors in the U.S.",
    "content": "Texas Instruments plans to invest more than $60 billion to manufacture billions of foundational semiconductors in the U.S.\nLeading U.S. companies Apple, Ford, Medtronic, NVIDIA and SpaceX strengthen partnerships with TI to unleash the next era of American innovation\nAn employee monitors a wafer transfer at one of Texas Instruments’ 300mm semiconductor fabs in Sherman, Texas, SM1.\nNEWS HIGHLIGHTS:\n- More than $60 billion investment includes seven U.S. semiconductor fabs across three manufacturing mega-sites in Texas and Utah supporting more than 60,000 new U.S. jobs\n- Largest investment in foundational semiconductor manufacturing in U.S. history, building on TI’s almost-100-year legacy\n- TI’s largest mega-site in Sherman, Texas includes investment of up to $40 billion dollars for four fabs: SM1 and SM2 – already underway – and two additional fabs, SM3 and SM4\n- Leverages TI’s strengths as a global technology and manufacturing leader to advance critical innovations from vehicles to smartphones to data centers\nDALLAS, June 18, 2025 – Texas Instruments (TI) (Nasdaq: TXN) today announced its plans to invest more than $60 billion across seven U.S. semiconductor fabs, making this the largest investment in foundational semiconductor manufacturing in U.S. history. Working with the Trump administration and building on the company’s nearly 100-year legacy, TI is expanding its U.S. manufacturing capacity to supply the growing need for semiconductors that will advance critical innovations from vehicles to smartphones to data centers. Combined, TI’s new manufacturing mega-sites in Texas and Utah will support more than 60,000 U.S. jobs.\n“TI is building dependable, low-cost 300mm capacity at scale to deliver the analog and embedded processing chips that are vital for nearly every type of electronic system,” said Haviv Ilan, president and CEO of Texas Instruments. “Leading U.S. companies such as Apple, Ford, Medtronic, NVIDIA and SpaceX rely on TI’s world-class technology and manufacturing expertise, and we are honored to work alongside them and the U.S. government to unleash what’s next in American innovation.”\n“For nearly a century, Texas Instruments has been a bedrock American company driving innovation in technology and manufacturing,” said U.S. Secretary of Commerce, Howard Lutnick. “President Trump has made it a priority to increase semiconductor manufacturing in America – including these foundational semiconductors that go into the electronics that people use every day. Our partnership with TI will support U.S. chip manufacturing for decades to come.”\nUnleashing what’s next in American innovation\nToday, TI is the largest foundational semiconductor manufacturer in the U.S., producing analog and embedded processing chips that are critical for smartphones, vehicles, data centers, satellites and nearly every other electronic device. In order to meet the steadily growing demand for these essential chips, TI is building on its legacy of technology leadership and expanding its U.S. manufacturing presence to help its customers pioneer the next wave of technological breakthroughs.\nIgniting intelligence with Apple\n“Texas Instruments' American-made chips help bring Apple products to life, and together, we’ll continue to create opportunity, drive innovation, and invest in the future of advanced manufacturing across the U.S.,” said Apple’s CEO Tim Cook.\nFueling the future with Ford\nFord and TI are working to strengthen American manufacturing, combining Ford’s automotive expertise with TI’s semiconductor technology to help drive innovation and secure a robust, domestic supply chain for the future of mobility. “At Ford, 80% of the vehicles we sell in the U.S. are assembled in the U.S., and we are proud to stand with technology leaders like TI that continue to invest in manufacturing in the U.S.,” said Jim Farley, President and CEO of Ford Motor Company.\nConnecting patient care with Medtronic\nMedtronic and TI are partnering to improve lives when it matters most. “At Medtronic, our life-saving medical technologies rely on semiconductors to deliver precision, performance, and innovation at scale,” said Geoff Martha, Medtronic chairman and CEO. “Texas Instruments has been a vital partner – especially during the global chip shortages – helping us maintain supply continuity and accelerate the development of breakthrough therapies. We’re proud to leverage TI’s U.S.-manufactured semiconductors as we work to transform healthcare and improve outcomes for patients around the world.”\nAdvancing AI with NVIDIA\nNVIDIA is partnering with TI to unleash the next generation of artificial intelligence architectures. “NVIDIA and TI share the goal to revitalize U.S. manufacturing by building more of the infrastructure for AI factories here in the U.S.,” said Jensen Huang, founder and CEO of NVIDIA. “We look forward to continuing our collaboration with TI by developing products for advanced AI infrastructure.”\nSecuring high-speed satellite internet with SpaceX\nSpaceX is increasingly leveraging TI’s high-speed process technology to connect its Starlink satellite internet service with TI’s latest 300mm SiGe technology manufactured in Sherman, Texas. “Our fundamental mission is to revolutionize global connectivity and eliminate the digital divide. Core to this mission is constantly pushing the boundaries of what is possible,” said Gwynne Shotwell, president and COO of SpaceX. “SpaceX is manufacturing tens of thousands of Starlink kits a day – all right here in the U.S. – and we are making huge investments in PCB manufacturing and silicon packaging to expand even further. TI’s U.S.-made semiconductors are crucial for securing a U.S. supply chain for our products, and their advanced silicon manufacturing capabilities provide the performance and reliability needed to help us meet the growing demand for high-speed internet all around the world.”\nTexas Instruments’ new 300mm semiconductor fabs in Sherman, Texas, SM1 and SM2.\nBacked by the strength of TI’s U.S. manufacturing presence\nTI is a driving force behind the return and expansion of semiconductor manufacturing in the U.S. The company’s more than $60 billion investment in U.S. manufacturing includes building and ramping seven, large-scale, connected fabs. Combined, these fabs across three manufacturing mega-sites in Texas and Utah will manufacture hundreds of millions of U.S.-made chips daily that will ignite a bold new chapter in American innovation.\n- Sherman, Texas: SM1, TI’s first new fab in Sherman will begin initial production this year, just three years after breaking ground. Construction is also complete on the exterior shell of SM2, TI’s second new fab in Sherman. Incremental investment plans include two additional fabs, SM3 and SM4, to support future demand.\n- Richardson, Texas: TI’s second fab in Richardson, RFAB2, continues to ramp to full production and builds on the company’s legacy of introducing the world’s first 300mm analog fab, RFAB1, in 2011.\n- Lehi, Utah: TI is ramping LFAB1, the company’s first 300mm wafer fab in Lehi. Construction is also well underway on LFAB2, TI’s second Lehi fab that will connect to LFAB1.\nLearn more\n- Press kit (includes images, video b-roll and fact sheet)\n- Additional press kits (Sherman, Texas, Lehi, Utah, and Richardson, Texas)\nAbout Texas Instruments\nTexas Instruments Incorporated (Nasdaq: TXN) is a global semiconductor company that designs, manufactures, and sells analog and embedded processing chips for markets such as industrial, automotive, personal electronics, communications equipment and enterprise systems. At our core, we have a passion to create a better world by making electronics more affordable through semiconductors. This passion is alive today as each generation of innovation builds upon the last to make our technology more reliable, more affordable and lower power, making it possible for semiconductors to go into electronics everywhere. Learn more at TI.com.",
    "article_url": "https://www.ti.com/about-ti/newsroom/news-releases/2025/texas-instruments-plans-to-invest-more-than--60-billion-to-manufacture-billions-of-foundational-semiconductors-in-the-us.html",
    "source_url": "https://www.ti.com/about-ti/newsroom/news-releases/2024/2024-10-24-texas-instruments-expands-internal-manufacturing-for-gallium-nitride--gan--semiconductors--quadrupling-capacity.html"
  },
  {
    "date": "2025-01-15",
    "headline": "Vermont Tech Hub Awarded Nearly $24M For Semiconductor Innovation | Office of the Vice President for Research (OVPR) | The University of Vermont",
    "content": "The Vermont Gallium Nitride (V-GaN) Tech Hub—a consortium led by the University of Vermont (UVM) and including GlobalFoundries and the State of Vermont—has been awarded $23.7M in federal funding. The investment from the U.S. Economic Development Administration is the largest research award in UVM history.\nThe Vermont Tech Hub will create a comprehensive technology ecosystem in the Green Mountain State and New England to drive semiconductor design and manufacturing of high-power and high-frequency gallium nitride (GaN) semiconductors. Pairing GlobalFoundries' semiconductor leadership with UVM’s world-class researchers, the Tech Hub will fuel business growth and workforce development to enhance the region's and state's economic and social vitality—bringing new cutting-edge facilities and computing technology to Vermont.\nThe Tech Hub will train over 500 new employees in the semiconductor workspace and engage over 6,000 K-12 students across Vermont in STEM participation in the next five years.\n“This $24M in federal funding for the Vermont Gallium Nitride Tech Hub solidifies UVM’s position as a national leader in research and workforce development within this critical technological field,” UVM interim president Patricia Prelock said. “We are profoundly grateful to our consortium partners—GlobalFoundries and the State of Vermont—and to our Congressional delegation for their collaboration and support in establishing the region and the state as a national hub for semiconductor innovation.”\nVermont’s Tech Hub is one of six federal hubs awarded funding in this cycle. The investment will advance innovative projects in Vermont promoting GaN semiconductor technology, economic growth, and workforce development, including:\n- Advanced Design Computing Center: A cutting-edge facility offering start-ups affordable access to advanced GaN and semiconductor design tools, reducing financial risks and fostering innovation. Partnering with UVM’s Vermont Advanced Computing Center, and Enterprise Technology Services, the center will support commercial and national security applications, driving next-gen computing solutions.\n- Test and Characterization Lab (TCL): Located at OnLogic in South Burlington, V-GaN’s TCL will be the only publicly accessible lab in the U.S. offering comprehensive testing and technical advice for high-power and high-frequency GaN devices. Its capabilities were developed with input from key stakeholders, including GlobalFoundries, UVM’s College of Engineering and Mathematical Sciences, and smaller regional semiconductor firms.\n- V-GaN Training, Innovation, Design and Engineering (TIDES): UVM’s Professional and Continuing Education division will lead this major workforce development effort, offering K-12 initiatives to spark interest in GaN technologies, career pathways to increase rural access to semiconductor manufacturing jobs, and continuing education in semiconductor design, manufacturing, and GaN-specific skills. Partners include the Community College of Vermont, Norwich University, the Vermont State University System, and the Vermont Manufacturing Extension Center.\n“The global demand for GaN and related semiconductor solutions is rapidly increasing, and we are determined to meet that demand,” said UVM Vice President for Research and Economic Development Kirk Dombrowski. “GaN not only holds promise for a wide range of applications in the technology space, it also provides an opportunity for V-GaN Tech Hub members to make northern New England the global leader in that space. This work benefited from the participation of more than 30 UVM partners—including GlobalFoundries, OnLogic, Cadence, and the Vermont Center for Emerging Technologies—and represents the next generation of UVM’s land grant mission.”\nTwelve companies have already committed to accelerating their product development through the V-GaN Tech Hub. The Tech Hub will make grant funding available to offset development costs for businesses owned by underserved and underrepresented populations in the semiconductor industry.\nLearn more and connect with the V-GaN Tech Hub at vgan.tech.\nQuotes:\n“Vermont’s new Tech Hub will benefit generations of researchers, tech innovators, and manufacturing leaders. The Biden-Harris Administration’s $23 million investment in the Green Mountain State’s technological and economic future is a testament to our innovative leadership, world-renowned research institutions, and our record of excellence in manufacturing,” said Senator Peter Welch. “While serving on the Senate Commerce Committee, I advocated for the Administration to invest in the Vermont Gallium Nitride Tech Hub at the University of Vermont and am thrilled to see the Department of Commerce selected the Vermont GaN Tech Hub consortium for one of six competitive Tech Hub awards. I thank Secretary Raimondo for her commitment to expanding opportunities in zip codes large and small. With this new funding, we’ll enter 2025 celebrating jobs, innovation, and the advancement of the bipartisan CHIPS and Science Act’s mission of bolstering our nation’s supply chain and onshoring manufacturing, right here in Vermont.”\n“I want to thank the U.S. Economic Development Administration for this investment in V-GaN and Vermont. Twenty-four million dollars is a tremendous endorsement of Vermont’s ability to maximize this cutting-edge technology,” said Vermont Commerce Secretary Lindsay Kurrle. “Thanks to the US EDA, the extraordinary leadership at the University of Vermont, and the expertise at GlobalFoundries, Vermont is now poised to be a world leader in GaN, fostering an ecosystem that features rapid development of chip design, prototyping, and testing that bolster our workforce, enrich our students, and attract talent from all over the world. The Agency of Commerce and Community Development is standing by to help V-GaN achieve its goals in any way we can. Gallium Nitride is the future of semiconductors and Vermont is ready, willing, and able to be at the forefront of this transition.”\n“GlobalFoundries is excited that the V-GaN Tech Hub has received implementation funding from the U.S. government. Thanks to our Congressional Delegation along with the Department of Science, the CHIPS and Science Act is fostering innovation and investment and will be pivotal in bringing new essential chip technologies, like GaN on silicon, to market,” said Ken McAvey, Vice President and General Manager of GlobalFoundries Vermont. “We look forward to our continued work with UVM and our other partners in driving U.S. leadership in GaN and advancing high-volume manufacturing of this technology.”\n“We have gotten to this point due to the efforts of dozens of collaborators that came together to create this proposal. In early 2023, leaders from GlobalFoundries, UVM and the state identified an opportunity for the region to benefit from the technological advancements taking place at the GlobalFoundries plant in Essex Junction,” said Doug Merrill, UVM’s Regional Innovation Officer. “Over the past 18 months leaders from technology firms, educational institutions, economic development organizations, and capital providers from around the state worked hard to create a plan to ensure that Northern New England will become a global center of excellence for high power and high frequency semiconductor development. National firms, including Cadence Design Systems, Keysight, Siemens, Intel, and RTX, have recognized this potential and signed on as well. I’m continually humbled by the hard work that our partners have contributed to this Hub and am incredibly grateful that the EDA has selected us for implementation funding. While our excitement about the potential benefits of this funding is tremendous, it is tempered by the responsibility of ensuring that we put this investment to good use and ensure that it creates good jobs and growing businesses across our region for years to come.”",
    "article_url": "https://www.uvm.edu/ovpr/news/vermont-tech-hub-awarded-nearly-24m-semiconductor-innovation",
    "source_url": "https://www.uvm.edu/ovpr/news/vermont-tech-hub-awarded-nearly-24m-semiconductor-innovation"
  },
  {
    "date": "2024-12-17",
    "headline": "GlobalFoundries Supports CEMS Students with New Scholarship Program | College of Engineering and Mathematical Sciences | The University of Vermont",
    "content": "BURLINGTON, Vt., December 18, 2024 — Students at UVM’s College of Engineering and Mathematical Sciences (CEMS) will soon benefit from a new scholarship program established by GlobalFoundries (GF). As part of GF’s ongoing commitment to developing workforce talent in semiconductor design and manufacturing in the region, the GlobalFoundries Scholarship will support students enrolled in undergraduate degree programs in physics, or electrical, mechanical, biomedical, or environmental engineering.\nIn the program’s initial year, GF will support three undergraduate students with scholarships of $10,000 each, and the scholarships are combined with a paid summer internship opportunity at GF. The scholarship will support up to six new and returning scholars in successive years. The program is designed to incentivize students to join the semiconductor industry.\nIn addition to the valuable hands-on experience of the internship, scholars will also be matched with a GF mentor for the duration of the scholarship period and will have the opportunity to serve as student ambassadors, speaking about their experiences in the program at campus events with GF representatives.\n“This new scholarship program will have a lasting impact on UVM students, offering them a distinct blend of financial support, real-world experience, and professional development,” said Jay Caporale, Assistant Vice President of Corporate and Foundation Relations at the UVM Foundation. “This initiative ensures that scholars are well equipped to succeed in their careers and contribute meaningfully to innovation in their chosen fields.”\n“GF recognizes the vital role of collaborating with our local education institutions to cultivate a diverse and skilled semiconductor workforce. Our continued partnership with UVM underscores our unwavering commitment to nurturing the next generation of innovators and leaders in the industry,” said Ken McAvey, Vice President and General Manager at GF Vermont. “We are thrilled for this new scholarship program and look forward to working closely with UVM to create additional opportunities that will drive technological advancements and strengthen the semiconductor industry.”\nThrough a successful strategic partnership, GF and UVM have co-developed multiple other initiatives over the years to build the semiconductor workforce in the region, including paid student internships, capstone design project (SEED) sponsorship and mentorship, new undergraduate and graduate Certification in Semiconductor Engineering and Physics programs, curriculum advisement, career panelists, guest lecturers, and the participation of GF employees in UVM courses via a reduced tuition agreement.\nUVM’s groundbreaking Device Characterization Teaching Lab, Vermont’s first semiconductor lab, was launched in October 2023. The new lab, featuring a suite of scientific testing and analysis equipment donated by GF, heralded an essential phase of the ongoing initiative to prepare students to work in the rapidly expanding field. A day-long celebratory event, GlobalFoundries Day, featured a ribbon-cutting ceremony at the lab and unique career-building activities for students with GF employees.\nDays after the Device Characterization Teaching Lab’s opening, a consortium led by UVM and including GF and the State of Vermont was designated as one of 31 Tech Hubs by the U.S. Department of Commerce, unlocking the opportunity for up to $75M in federal grant funding to further research in semiconductor technology.\nThese joint initiatives are intended to attract top undergraduate and graduate students into the semiconductor industry and retain more highly skilled graduates in the Vermont workforce. Students from UVM’s engineering department, its Sustainable Innovation MBA program, and its environmental sciences program have worked at GF in areas such as chip manufacturing, HR, and advancing clean energy initiatives.\nAbout GF\nGlobalFoundries (GF) is one of the world’s leading semiconductor manufacturers. GF is redefining innovation and semiconductor manufacturing by developing and delivering feature-rich process technology solutions that provide leadership performance in pervasive high growth markets. GF offers a unique mix of design, development, and fabrication services. With a talented and diverse workforce and an at-scale manufacturing footprint spanning the U.S., Europe and Asia, GF is a trusted technology source to its worldwide customers. For more information, visit www.gf.com.\n©GlobalFoundries Inc., GF, GlobalFoundries, the GF logos and other GF marks are trademarks of GlobalFoundries Inc. or its subsidiaries. All other trademarks are the property of their respective owners.\nAbout the UVM Foundation\nThe University of Vermont Foundation is a nonprofit corporation dedicated to building relationships that yield private support for the benefit of the University of Vermont. It is defined by a culture of excellence, a belief in the power of philanthropy to change the world, and a commitment to diversity, equity, and inclusion. More information about the impact of donors and the work of the UVM Foundation can be found at www.uvmfoundation.org.",
    "article_url": "https://www.uvm.edu/news/cems/globalfoundries-supports-cems-students-new-scholarship-program",
    "source_url": "https://www.uvm.edu/ovpr/news/vermont-tech-hub-awarded-nearly-24m-semiconductor-innovation"
  },
  {
    "date": "2023-10-24",
    "headline": "Consortium with UVM, GlobalFoundries Wins Recognition as Tech Hub | UVM News | The University of Vermont",
    "content": "A consortium led by the University of Vermont and including GlobalFoundries and the State of Vermont has been designated as one of 31 Tech Hubs by the U.S. Department of Commerce’s Economic Development Administration (EDA), unlocking the opportunity for up to $75M in federal grant funding to further research in semiconductor technology.\nAdvancing Gallium Nitride (GaN) Technology in the Greater Burlington Area was selected by the Tech Hubs program from nearly 400 applications. The aim of the program is to “strengthen U.S. economic and national security by catalyzing technology-based regional growth that enables the industries of the future to start, grow, and remain in regions across our country,” according to the EDA’s announcement of the designation, which corresponded with a live event hosted by President Biden on Monday.\n“The consortium’s Tech Hub designation galvanizes UVM’s standing as a national leader in research and workforce development related to this vital technological space,” said UVM President Suresh Garimella. “We are deeply grateful to our partners in the consortium—GlobalFoundries, the Vermont Agency of Commerce and Community Development, and the Vermont State College System—for their collaboration and support helping establish Greater Burlington as a national center for semiconductor innovation.”\nThe EDA designation paves the way for the consortium to apply for Phase II of the program, which will culminate in award implementation grants totaling approximately $50-75 million to each of up to 10 Tech Hubs.\n“Investment in American innovation and supply chain independence is essential to our nation’s economic security and global competitiveness. We appreciate the Biden Administration and Congress for investing in this area, and the EDA for recognizing the important role small, more rural states like Vermont will have,” said Governor Phil Scott. “We are very proud Vermont’s Tech Hub has earned this designation, demonstrating our state’s leadership and commitment to innovation and advanced technology. We look forward to deepening our role in this critical sector and supporting the creation of good paying American jobs that will help communities thrive across our state.”\nPresident Joe Biden, joined by Secretary of Commerce Gina Raimondo and Director of the National Economic Council Lael Brainard, announces the Tech Hubs program at the Eisenhower Executive Office Building on October 23, 2023.\n“Innovation and creative cooperation have always been a major part of Vermont’s history,” said Senator Bernie Sanders, Senator Peter Welch, and Representative Becca Balint – Vermont’s Congressional Delegation. “Today, in this time of historically rapid technological advancement, Vermonters deserve every opportunity to be a part of the best of those innovations. We are glad to see this federally funded Tech Hub consortium come to Vermont and look forward to seeing all the good it will do for our rural workforce through the creation of good-paying jobs and improved economic and community development for people and towns across our state.”\nGaN technology, and other emerging semiconductor materials, are being rapidly adopted by the region’s semiconductor industry and promise growth across the entire tech sector with unique research potential, growth in ancillary and supply chain companies, and new opportunities for the regional workforce and education sectors. The goal of the Vermont Tech Hub is to build and sustain a successful ecosystem for advancing GaN and other semiconductor innovations, and in the process, to grow the economy and economic vitality of the region and the state.\n\"GlobalFoundries looks forward to deepening our partnership with UVM, working together to realize the full potential of high-volume manufacturing of GaN on silicon chips, and to driving U.S. leadership in this emerging technology,\" said Ken McAvey, Vice President and General Manager of GlobalFoundries Vermont. \"The CHIPS and Science Act has proven to be a successful catalyst for renewed enthusiasm, collaboration and investment in U.S. semiconductor manufacturing, and the Tech Program will be a critical vehicle for advancing new technologies through development and into the marketplace.\"\nThe estimated global demand for GaN and related semiconductor solutions is growing, and the technology invites significant potential uses and offers advantages over current semiconductor technology—it adds speed, power, and efficiency. GaN has the potential for many applications, including high-frequency radio communications, power electronics, automotive electronics, aerospace applications, high-performance medical imaging equipment, and consumer electronics.\n“We are happy to lead this successful consortium effort. EDA Tech Hub designation is an important step in our plan to build a successful innovation economy for Vermont—in the area of semiconductor materials and advanced chip design,” said Kirk Dombrowski, UVM Vice President for Research and Economic Development. “This work is part of UVM’s 21st century land grant mission—one that requires partnership and broad public and corporate engagement to unlock what we can do as a university and what we can do as a region.”\nThe CHIPS and Science Act signed into law in August 2022 authorized $10B in funding for the Tech Hubs Program. EDA has received $500 million—or 5 percent—of the authorized dollar amount and has designated 31 Tech Hubs and awarded 29 Strategy Development Grants.\nAt its core, the Tech Hubs Program is an economic development initiative designed to drive technology- and innovation-centric growth by strengthening a region’s capacity to manufacture, commercialize, and deploy critical technologies. The consortium’s regional vision is focused on the tech ecosystem that will emerge with the next generation of high-power, high-speed chips based on GaN. The northeast region has the partnerships, technology leaders, and research capacity to become a global leader in this technology.\nThe Tech Hub designation comes on the heels of last week’s launch of UVM’s new Device Characterization Lab, a partnership with GlobalFoundries with funding from the U.S. Department of Education aimed at driving semiconductor research and preparing students for key roles within the field.\n“This designation only confirms what we have long known and taken pride in: Greater Burlington is the technology hub of Vermont,” Burlington Mayor Miro Weinberger said. “The forward-thinking minds and companies here have long driven tech advancement for our region and are emerging as ever greater leaders nationally.”",
    "article_url": "https://www.uvm.edu/news/story/consortium-uvm-globalfoundries-wins-recognition-tech-hub",
    "source_url": "https://www.uvm.edu/ovpr/news/vermont-tech-hub-awarded-nearly-24m-semiconductor-innovation"
  },
  {
    "date": "2025-02-27",
    "headline": "Polar Semiconductor Celebrates NSTC as It Surpasses 100 Members",
    "content": "Polar Semiconductor Celebrates Membership to National Semiconductor Technology Center as It Surpasses 100 Members\nPolar Semiconductor benefits from access to a dynamic ecosystem of resources, facilities, and collaboration opportunities to advance its research, innovation, and workforce efforts.\nBloomington, MN – February 27, 2025 – Polar Semiconductor (“Polar”) today celebrates its membership to the National Semiconductor Technology Center (NSTC) as the public-private consortium established by the CHIPS and Science Act surpasses 100 signed members. Polar supports the NSTC’s mission to accelerate U.S.-led semiconductor research and innovation, build a strong domestic semiconductor workforce, and strengthen the United States’ leadership position in the global semiconductor industry.\n“Polar Semiconductor is proud to be a member of the National Semiconductor Technology Center as its membership and impact continues to grow,” said Surya Iyer, President and COO of Polar. “We’re excited to contribute our expertise in sensor, power, and high-voltage semiconductors and closely collaborate with other members to accelerate U.S.-led semiconductor research and innovation.\nOperated by Natcast, an independent non-profit entity, the mission of the NSTC is to convene members from across the U.S. semiconductor value chain, academia, and government to advance three shared and strategic goals: strengthen U.S. semiconductor leadership; reduce time from lab-to-fab; and expand the U.S. semiconductor workforce. NSTC Members benefit from access to leading-edge research, state-of-the-art facilities, shared physical and digital assets, dedicated events and collaboration opportunities, and employer-driven workforce development programming.\nThe NSTC’s mission aligns with Polar’s commitment to fostering technological advancement and contributing to the nation’s economic growth and national security.\nTo view a comprehensive list of NSTC Members and learn how to join, visit natcast.org/nstcmembership/members. For more information on opportunities to engage with Polar Semiconductor on NSTC-related efforts, please visit polarsemi.com/contact.\nABOUT POLAR SEMICONDUCTOR\nHeadquartered in Bloomington, Minnesota, Polar Semiconductor is the only U.S.-based manufacturer specializing in sensor, power, and high-voltage semiconductors. Polar brings more than 60 years of experience in the automotive, consumer, and industrial markets, and is investing approximately $525 million to expand its foundry and branch into innovative technologies to serve new customers and markets. Polar’s semiconductor manufacturing facilities operate with state-of-the-art automation systems to manufacture Integrated Circuit (BCD, BiCMOS) and Discrete (MOSFET, IGBT) 8-inch silicon wafers for the power and sensor markets. As an automotive-qualified fab, Polar is committed to the highest levels of manufacturing and product quality. For more information, visit polarsemi.com.\nABOUT THE NSTC AND NATCAST\nNatcast is a purpose-built, non-profit entity designated to operate the National Semiconductor Technology Center (NSTC) by the Department of Commerce. Established by the CHIPS and Science Act of the U.S. government, the NSTC is a public-private consortium dedicated to semiconductor R&D in the United States. The NSTC convenes industry, academia, and government from across the semiconductor ecosystem to address the most challenging barriers to continued technological progress in the domestic semiconductor industry, including the need for a skilled workforce. The NSTC reflects a once-in-a-generation opportunity for the U.S. to drive the pace of innovation, set standards, and secure global leadership in semiconductor design and manufacturing. Learn more at natcast.org.",
    "article_url": "https://polarsemi.com/news/polar-celebrates-nstc-as-it-surpasses-100-members/",
    "source_url": "https://polarsemi.com/news/polar-signs-agreement-with-renesas-to-license-gan-on-si-technology/"
  },
  {
    "date": "2025-04-16",
    "headline": "Polar Signs Agreement with Renesas to License GaN-on-Si Technology",
    "content": "Polar Signs Agreement with Renesas to License GaN-on-Si Technology and Onshore Commercial Fabrication of Advanced Devices on 200mm Wafers\nThe Partnership Strengthens the Domestic Supply Chain and Enhances Access to this Dual-Use Technology to the U.S. Customer Base\nBloomington, MN – April 16, 2025 – Polar Semiconductor (“Polar”), the only U.S.-owned merchant foundry specializing in sensor, power, and high-voltage semiconductors, announced today the finalization of a strategic agreement with Renesas Electronics Corporation (“Renesas”) to license their Gallium Nitride on Silicon D-Mode (GaN-on-Si) technology. As part of this agreement, Polar will fabricate High Voltage 650V Class GaN-on-Si devices for Renesas and other customers in its 200mm automotive quality high-volume manufacturing facility in Minnesota. This facility, recently expanded with state-of-the-art processing and automation equipment, is poised to meet growing demand for next-generation semiconductor solutions.\nPolar and Renesas will work together to scale commercial production of GaN devices, expanding its use across critical industries, including automotive, data center, consumer, industrial, and aerospace & defense markets. The agreement ensures the U.S. has a reliable, domestic source for this cutting-edge semiconductor technology.\nMarket adoption of GaN technology will be accelerated through cost efficiency and innovative device architectures enabled by scaling to 200mm fabrication. By leveraging Polar’s manufacturing expertise and Renesas’ proven power semiconductor technology and commercial leadership, this strategic collaboration ensures customers a secure supply of cost-competitive, superior quality, and high-performance GaN device wafers.\nSurya Iyer, President and COO of Polar Semiconductor, said, “This licensing and commercial production agreement underscores our commitment to strengthening the domestic semiconductor ecosystem. GaN is a game-changing technology for Power and RF, and with Renesas as our partner, we are well-positioned to ramp commercial production, secure key defense programs, and drive the next wave of semiconductor innovation.”\n“We are excited to partner with Polar to scale our proven GaN technology to 200mm wafers and leverage our know-how across broad power conversion markets ranging from Infrastructure & AI to Energy & Industrial to e-Mobility & xEVs to high-value IoT,” said Chris Allexandre, SVP & GM, Power Products Group, at Renesas. “This collaboration ensures a strong, U.S.-based manufacturing capability for GaN products, provides multi-sourcing to our customers, and meets the growing demand for high-performance power solutions.”\nAbout Polar Semiconductor\nHeadquartered in Bloomington, Minnesota, Polar Semiconductor is the only U.S.-based merchant foundry specializing in sensor, power, and high-voltage semiconductors. With over 60 years of experience in automotive, consumer, and industrial markets, Polar is investing significantly to expand its foundry and introduce cutting-edge technologies. As an automotive-qualified fab, Polar is committed to the highest levels of manufacturing and product quality. For more information, visit polarsemi.com.",
    "article_url": "https://polarsemi.com/news/polar-signs-agreement-with-renesas-to-license-gan-on-si-technology/",
    "source_url": "https://polarsemi.com/news/polar-signs-agreement-with-renesas-to-license-gan-on-si-technology/"
  },
  {
    "date": "2025-04-16",
    "headline": "News Archives - Polar Semiconductor, LLC",
    "content": "04. 16. 2025\nThe Partnership Strengthens the Domestic Supply Chain and Enhances Access to this Dual-Use Technology to the U.S. Customer Base Bloomington, MN – April 16, 2025 – Polar Semiconductor (“Polar”), the only U.S.-owned merchant foundry…\nRead More »\n02. 27. 2025\nPolar Semiconductor benefits from access to a dynamic ecosystem of resources, facilities, and collaboration opportunities to advance its research, innovation, and workforce efforts. Bloomington, MN – February 27, 2025 – Polar Semiconductor (“Polar”) today celebrates…\nRead More »\n02. 25. 2025\nKitchener, Ontario, February 25, 2025 – PEER Group®, the largest supplier of innovative factory automation software products for the semiconductor industry, and Polar Semiconductor, a U.S.-based semiconductor manufacturer specializing in sensor, power, and high-voltage wafer…\nRead More »\n01. 21. 2025\nAdditional companies pursue workforce investments, partnerships, and offerings under the CHIPS Women in Construction Framework. Following the launch of the CHIPS Women in Construction Framework in May 2024, the Department of Commerce announced additional companies…\nRead More »\n01. 15. 2025\nPolar has finalized an agreement to License Tower Semiconductor’s Robust TS18PM Power Semiconductor Technology. Polar Gains a Versatile Process Design Kit (PDK) and will enable Onshore Manufacturing of Customer’s Products at its 200mm fab in…\nRead More »\n09. 26. 2024\nWalk into the clean room at Polar Semiconductor, and you’ll encounter a different world. Anyone who enters is required to wear protective clothing. A row of chambers is bathed in yellow light — less harmful…\nRead More »\n09. 24. 2024\nPolar’s Historic $525 Million Investment Is Led by a $175 Million Contribution from Niobrara Capital and Prysm Capital, the Majority Investors in the U.S.-Owned Foundry, and Is Catalyzed through Federal and State of Minnesota Incentives.…\nRead More »\n06. 18. 2024\nJune 18, 2024 Announcement is Part of Secretary Raimondo’s Million Women in Construction Initiative Today, the U.S. Department of Commerce announced GlobalFoundries and Polar Semiconductor have voluntarily committed to adopt the CHIPS Women in Construction Framework. The…\nRead More »\n05. 13. 2024\nPolar’s Historic $525 Million Investment to Be Supported by Minnesota State Incentives and Potential Federal Funding from the CHIPS and Science Act Niobrara Capital and Prysm Capital Will Lead $175 Million Equity Investment in Polar…\nRead More »\n06. 16. 2023\nThe University of Minnesota's Technological Leadership Institute (TLI) today announced the launch of the Minnesota Semiconductor Manufacturing Consortium, a groundbreaking initiative aimed at upskilling Minnesota's technical workforce for careers in semiconductor manufacturing. With the generous…\nRead More »",
    "article_url": "https://polarsemi.com/category/news/",
    "source_url": "https://polarsemi.com/news/polar-signs-agreement-with-renesas-to-license-gan-on-si-technology/"
  },
  {
    "date": "2024-09-11",
    "headline": "Infineon pioneers world’s first 300 mm power gallium nitride (GaN) technology – an industry game-changer - Infineon Technologies",
    "content": "Infineon pioneers world’s first 300 mm power gallium nitride (GaN) technology – an industry game-changer\n- Infineon will shape the rapidly growing GaN market with this groundbreaking GaN 300 mm technology\n- Infineon leverages existing large scale 300 mm silicon manufacturing to maximize capital efficiency in GaN production\n- 300 mm GaN will help achieve cost parity with silicon over time\nMunich, Germany and Villach, Austria – 11 September 2024 – Infineon Technologies AG (FSE: IFX / OTCQX: IFNNY) today announced that the company has succeeded in developing the world’s first 300 mm power gallium nitride (GaN) wafer technology. Infineon is the first company in the world to master this groundbreaking technology in an existing and scalable high-volume manufacturing environment. The breakthrough will help substantially drive the market for GaN-based power semiconductors. Chip production on 300 mm wafers is technologically more advanced and significantly more efficient compared to 200 mm wafers, since the bigger wafer diameter fits 2.3 times as many chips per wafer.\nGaN-based power semiconductors find fast adoption in industrial, automotive, and consumer, computing & communication applications, including power supplies for AI systems, solar inverters, chargers and adapters, and motor-control systems. State-of-the art GaN manufacturing processes lead to improved device performance resulting in benefits in end customers’ applications as it enables efficiency performance, smaller size, lighter weight, and lower overall cost. Furthermore, 300 mm manufacturing ensures superior customer supply stability through scalability.\n“This remarkable success is the result of our innovative strength and the dedicated work of our global team to demonstrate our position as the innovation leader in GaN and power systems,” said Jochen Hanebeck, CEO of Infineon Technologies AG. “The technological breakthrough will be an industry game-changer and enable us to unlock the full potential of gallium nitride. Nearly one year after the acquisition of GaN Systems, we are demonstrating again that we are determined to be a leader in the fast-growing GaN market. As a leader in power systems, Infineon is mastering all three relevant materials: silicon, silicon carbide and gallium nitride.”\nInfineon has succeeded in manufacturing 300 mm GaN wafers on an integrated pilot line in existing 300 mm silicon production in its power fab in Villach (Austria). The company is leveraging well-established competence in the existing production of 300 mm silicon and 200 mm GaN. Infineon will further scale GaN capacity aligned with market needs. 300 mm GaN manufacturing will put Infineon in a position to shape the growing GaN market which is estimated to reach several billion US-Dollars by the end of the decade.\nThis pioneering technological success underlines Infineon's position as a global semiconductor leader in power systems and IoT. Infineon is implementing 300 mm GaN to strengthen existing and enabling new solutions and application fields with an increasingly cost-effective value proposition and the ability to address the full range of customer systems. Infineon will present the first 300 mm GaN wafers to the public at the electronica trade show in November 2024 in Munich.\nA significant advantage of 300 mm GaN technology is that it can utilize existing 300 mm silicon manufacturing equipment, since gallium nitride and silicon are very similar in manufacturing processes. Infineon’s existing high-volume silicon 300 mm production lines are ideal to pilot reliable GaN technology, allowing accelerated implementation and efficient use of capital. Fully scaled 300 mm GaN production will contribute to GaN cost parity with silicon on R DS(on) level, which means cost parity for comparable Si and GaN products.\n300 mm GaN is another milestone in Infineon’s strategic innovation leadership and supports Infineon’s mission of decarbonization and digitalization.\nAbout Infineon\nInfineon Technologies AG is a global semiconductor leader in power systems and IoT. Infineon drives decarbonization and digitalization with its products and solutions. The company has around 58,600 employees worldwide and generated revenue of about €16.3 billion in the 2023 fiscal year (ending 30 September). Infineon is listed on the Frankfurt Stock Exchange (ticker symbol: IFX) and in the USA on the OTCQX International over-the-counter market (ticker symbol: IFNNY).\nInformation Number\nINFXX202409-142\nPress Photos\n-\nInfineon CEO Jochen Hanebeck holds one of the world’s first 300 mm GaN Power wafers produced in an existing and scalable high-volume manufacturing environment.Hanebeck_GaN300\nJPG | 2.06 mb | 2126 x 1417 px\n-\nA technical engineer in the cleanroom at Infineon Technologies in Villach, Austria, holds a 300 mm gallium nitride wafer.Infineon_GaN300_Wafer_Villach\nJPG | 337 kb | 2126 x 1417 px\n-\nChip production on 300 mm wafers is more efficient compared to 200 mm wafers, since the bigger wafer diameter offers 2.3 times more chips per wafer.Infineon_GaN300_Wafer\nJPG | 867 kb | 2126 x 1417 px",
    "article_url": "https://www.infineon.com/cms/en/about-infineon/press/press-releases/2024/INFXX202409-142.html",
    "source_url": "https://www.infineon.com/cms/en/about-infineon/press/market-news/2025/INFPSS202501-049.html"
  },
  {
    "date": "2025-02-26",
    "headline": "英飞凌发布《2025年GaN功率半导体预测报告》：GaN将在多个行业达到应用临界点，进一步提高能源效率 - Infineon Technologies",
    "content": "英飞凌发布《2025年GaN功率半导体预测报告》：GaN将在多个行业达到应用临界点，进一步提高能源效率\n【 2025 年 2 月 26 日 , 德国慕尼黑讯】在全球持续面临气候变化和环境可持续发展挑战之际，英飞凌科技股份公司（FSE代码：IFX / OTCQX代码： IFNNY）一直站在创新前沿，利用包括硅（Si）、碳化硅（SiC）和氮化镓（GaN）在内的所有相关半导体材料大幅推动低碳化和数字化领域的发展。\n英飞凌在其 《2025年GaN功率半导体预测报告》中强调，GaN将成为影响游戏规则的半导体材料，它将极大改变大众在消费、交通出行、住宅太阳能、电信和AI数据中心等领域提高能效和推进低碳化的方式。GaN可为终端客户的应用带来显著优势，包括提高性能效率、缩小尺寸、减轻重量和降低总体成本。如今USB-C充电器和适配器在GaN的应用方面已经处于领先，有更多行业即将达到GaN应用的临界点，从而极大地推动了基于GaN的功率半导体市场的发展。\n英飞凌GaN业务线负责人Johannes Schoiswohl表示：“英飞凌致力于通过基于包括Si、SiC和GaN在内的全部半导体材料的创新来推动低碳化和数字化转型。凭借在效率、密度和尺寸方面的优势，GaN将在综合功率系统中发挥日益重要的作用。而且鉴于GaN与Si的成本差距正在缩小，我们预计GaN的利用率将在今年及未来持续增长。”\n氮化镓技术对于人工智能的供能需求至关重要。随着AI数据中心算力和能源需求的快速增长，市场愈发需要能够处理AI服务器相关巨大负载的先进解决方案。曾经管理3.3 kW功率的电源现在正向着5.5 kW发展，预计未来每台将达到12 kW或更高。使用GaN可以提高AI数据中心的功率密度，这直接影响到在给定机架空间内可提供的算力。虽然GaN具有明显的优势，但将其与Si和SiC结合使用才是满足AI数据中心要求，并在效率、功率密度和系统成本之间实现综合权衡的理想选择。\n在家电市场，由于洗衣机、烘干机、冰箱和水泵/热泵等应用需要达到更高的能效等级，因此英飞凌预计GaN将实现快速发展。例如：在800 W应用中，GaN可使能效提高2%，从而帮助制造商实现A 级能效。根据英飞凌的研究，基于GaN的电动汽车车载充电器和DC-DC转换器将具有更高的充电效率、功率密度和材料可持续性，而且正向20 kW以上的系统转型。GaN还将与高端SiC解决方案一同实现更加高效的400 V和800 V电动汽车系统牵引逆变器，增加电动汽车的行驶里程。\n由于GaN材料能够提高紧凑性，机器人行业将在2025 年及以后广泛使用GaN，这将推动送货无人机、护理机器人和人形机器人的发展。而随着机器人技术与自然语言处理、计算机视觉等先进AI技术的融合，GaN将提供实现紧凑、高性能设计所需的效率。例如：将逆变器集成在电机机箱内，既可以避免使用逆变器散热片，同时又能减少每个关节/轴的线缆，并简化EMC设计。\n为了解决在成本和可扩展性方面的挑战，英飞凌正进一步增加对GaN研发的投资。凭借丰富的产品和 IP 组合、严格的质量标准，以及 300 mm GaN晶圆制造和双向开关（BDS）晶体管等前沿创新技术，英飞凌正以包括GaN在内的所有相关半导体材料为基础，巩固自身在推动低碳化和数字化方面的领先地位。\n点击 此处下载电子书《2025年GaN预测报告》。\nAbout Infineon\n英飞凌科技股份公司是全球功率系统和物联网领域的半导体领导者。英飞凌以其产品和解决方案推动低碳化和数字化进程。该公司在全球拥有约58,060名员工，在2024财年（截至9月30日）的营收约为150亿欧元。英飞凌在法兰克福证券交易所上市（股票代码：IFX），在美国的OTCQX国际场外交易市场上市（股票代码：IFNNY）。\n更多信息，请访问 www.infineon.com\n更多新闻，请登录英飞凌新闻中心： https://www.infineon.com/cms/en/about-infineon/press/press-releases/\n关注我们: 英飞凌官微 - X - Facebook - LinkedIn\nInformation Number\nINFPSS202501-049",
    "article_url": "https://www.infineon.com/cms/cn/about-infineon/press/market-news/2025/INFPSS202501-049.html",
    "source_url": "https://www.infineon.com/cms/en/about-infineon/press/market-news/2025/INFPSS202501-049.html"
  },
  {
    "date": "2025-01-30",
    "headline": "Infineon 2025 predictions – Gallium Nitride (GaN) semiconductors: GaN to reach adoption tipping points in multiple industries, further driving energy efficiency - Infineon Technologies",
    "content": "Infineon 2025 predictions – Gallium Nitride (GaN) semiconductors: GaN to reach adoption tipping points in multiple industries, further driving energy efficiency\nMunich, Germany – 30 January 2025 – As the world continues to face the challenges of climate change and environmental sustainability, Infineon Technologies AG (FSE: IFX / OTCQX: IFNNY) is at the forefront of innovation, harnessing the power of all relevant semiconductor materials including silicon (Si), silicon carbide (SiC), and gallium nitride (GaN) to drive meaningful progress towards decarbonization and digitalization.\nIn its 2025 predictions – GaN power semiconductors, Infineon highlights that gallium nitride will be a game-changing semiconductor material revolutionizing the way we approach energy efficiency and decarbonization across consumer, mobility, residential solar, telecommunication, and AI data center industries. GaN provides significant benefits in end customers’ applications enabling efficient performance, smaller size, lighter weight, and lower overall cost. While USB-C chargers and adapters have been the forerunners, GaN is now on its way to reaching tipping points in its adoption in further industries, substantially driving the market for GaN-based power semiconductors.\n”Infineon is committed to driving decarbonization and digitalization through innovation based on all semiconductor materials Si, SiC, and GaN,” said Johannes Schoiswohl, Head of the GaN Business Line at Infineon. “The relevance of comprehensive power systems will increase with GaN manifesting its role due to its benefits in efficiency, density, and size. Given that cost-parity with silicon is in sight, we will see an increased adoption rate for GaN this year and beyond.\nPowering AI will be highly depending on GaN. The rapid increase of required computing power and energy demand in AI data centers will drive the need for advanced solutions capable of handling the substantial loads associated with AI servers. Power supplies that once managed 3.3 kW are now evolving towards 5.5 kW, with projections moving towards 12 kW or more per unit. By leveraging GaN, AI data centers can improve power density, which directly influences the amount of computational power that can be delivered within a given rack space. While GaN presents clear advantages, hybrid approaches combining GaN with Si and SiC are ideal for meeting the requirements of AI data centers and achieving the best trade-offs between efficiency, power density and system cost.\nIn the home appliance market, Infineon expects GaN to gain significant traction, driven by the need for higher energy efficiency ratings in applications like washing machines, dryers, refrigerators and water/heat pumps. In 800 W applications, for example, GaN can enable a two percent efficiency gain, which can help manufacturers achieve the coveted A ratings. According to Infineon, GaN-based on-board chargers and DC-DC converters in electric vehicles will contribute to a higher charging efficiency, power density, and material sustainability, with a shift towards 20 kW+ systems. Together with high-end SiC solutions, GaN will also enable more efficient traction inverters for both 400 V and 800 V EV systems, contributing to an increased driving range.\nIn 2025 and beyond, robotics will see widespread adoption of GaN supported by the material's ability to enhance compactness, driving growth in delivery drones, care robots and humanoid robots. As robotics technology integrates AI advancements like natural language processing and computer vision, GaN will provide the efficiency required for compact, high-performance designs. Integrating inverters within the motor chassis eliminates the inverter heatsink while reducing cabling to each joint/axis and simplifying EMC design.\nInfineon is further pushing investment in GaN research and development to overcome the challenges of cost and scalability. With the broadest product and IP portfolio, the highest quality standards, leading-edge innovations such as 300 mm GaN wafer manufacturing and bidirectional switch (BDS) transistors, the company is bolstering its leading role in driving decarbonization and digitalization based on all relevant semiconductor materials including gallium nitride.\nAvailability\nDownload the “2025 GaN predictions” ebook here.\nAbout Infineon\nInfineon Technologies AG is a global semiconductor leader in power systems and IoT. Infineon drives decarbonization and digitalization with its products and solutions. The Company had around 58,060 employees worldwide (end of September 2024) and generated revenue of about €15 billion in the 2024 fiscal year (ending 30 September). Infineon is listed on the Frankfurt Stock Exchange (ticker symbol: IFX) and in the USA on the OTCQX International over-the-counter market (ticker symbol: IFNNY).\nInformation Number\nINFPSS202501-049\nPress Photos\n-\nBy leveraging GaN, AI data centers can improve power density, which directly influences the amount of computational power.CoolGaN\nJPG | 446 kb | 2126 x 2126 px",
    "article_url": "https://www.infineon.com/cms/en/about-infineon/press/market-news/2025/INFPSS202501-049.html",
    "source_url": "https://www.infineon.com/cms/en/about-infineon/press/market-news/2025/INFPSS202501-049.html"
  },
  {
    "date": "2025-01-30",
    "headline": "Infineon Prognosen 2025 – Gallium Nitride (GaN)-Halbleiter: GaN erreicht Durchbruch in weiteren Branchen und treibt Energieeffizienz weiter voran - Infineon Technologies",
    "content": "Infineon Prognosen 2025 – Gallium Nitride (GaN)-Halbleiter: GaN erreicht Durchbruch in weiteren Branchen und treibt Energieeffizienz weiter voran\nMünchen, 30. Januar 2025 – Während die Welt weiterhin mit den Herausforderungen des Klimawandels und der ökologischen Nachhaltigkeit konfrontiert ist, setzt sich die Infineon Technologies AG an vorderster Front für Innovationen ein. Dabei nutzt das Unternehmen die Leistungsfähigkeit aller relevanten Halbleitermaterialien wie Silizium (Si), Siliziumkarbid (SiC) und Galliumnitrid (GaN), um signifikante Fortschritte bei der Dekarbonisierung und Digitalisierung zu erreichen.\nIn den 2025 predictions – GaN power semiconductors betont Infineon, dass es sich bei Galliumnitrid um eines der bedeutendsten Halbleitermaterialen handelt: Es wird die Art und Weise revolutionieren, wie Energieeffizienz und Dekarbonisierung in den Bereichen Consumer, Mobilität, Residential Solar, Telekommunikation und KI-Rechenzentren umgesetzt werden. Für die Anwendungen der Hersteller und Endkunden bietet GaN erhebliche Vorteile und ermöglicht eine effiziente Leistung, Größeneinsparungen, geringeres Gewicht und niedrigere Gesamtkosten. Während USB-C-Ladegeräte und Adapter die Vorreiter waren, steht GaN nun kurz davor, sich in weiteren Branchen durchzusetzen, was den Markt für GaN-basierte Leistungshalbleiter erheblich vorantreiben wird.\n„Infineon hat sich das Ziel gesetzt, die Dekarbonisierung und Digitalisierung durch Innovationen voranzutreiben, die auf allen Halbleitermaterialien Si, SiC und GaN basieren“, sagt Johannes Schoiswohl, Leiter der GaN Business Line bei Infineon. „Die Bedeutung umfassender Energiesysteme wird zunehmen, wobei GaN aufgrund seiner Vorteile bei Effizienz, Leistungsdichte und Größe eine wichtige Rolle spielt. Da die Kostenparität mit Silizium in greifbare Nähe rückt ist, werden wir in diesem Jahr und darüber hinaus eine höhere Akzeptanz von GaN erleben.“\nEine effiziente Stromversorgung von KI wird in hohem Maße von GaN abhängen. Der rasante Anstieg der benötigten Rechenleistung und des Energiebedarfs in KI-Rechenzentren wird den Bedarf an fortschrittlichen Lösungen, die die erheblichen Lasten von KI-Servern bewältigen, weiter erhöhen. Stromversorgungen, die früher 3,3 kW leisteten, entwickeln sich jetzt in Richtung 5,5 kW. Die Prognosen gehen in Richtung 12 kW oder mehr pro Einheit. Durch den Einsatz von GaN können KI-Rechenzentren die Leistungsdichte verbessern, was sich direkt auf die Menge an Rechenleistung auswirkt, die in einem bestimmten Rack zur Verfügung gestellt werden kann. Während GaN klare Vorteile bietet, sind hybride Ansätze, bei denen GaN mit Silizium und Siliziumkarbid kombiniert wird, ideal, um die Anforderungen von KI-Rechenzentren zu erfüllen. Sie erzielen die besten Kompromisse zwischen Effizienz, Leistungsdichte und Systemkosten.\nInfineon erwartet, dass GaN auf dem Markt für Haushaltsgeräte stark an Bedeutung gewinnen wird, da Geräte wie Waschmaschinen, Trockner, Kühlschränke und Wasser-/Wärmepumpen höhere Energieeffizienzwerte benötigen. Bei 800-Watt-Anwendungen kann GaN zum Beispiel eine Effizienzsteigerung von zwei Prozent ermöglichen, was den Herstellern dabei hilft, die begehrten A-Bewertungen zu erreichen. Mit einer Verschiebung hin zu 20-kW-Systemen und mehr werden On-Board-Charger und DC-DC-Wandler auf GaN-Basis in Elektrofahrzeugen laut Infineon zu einer höheren Ladeeffizienz, Leistungsdichte und Materialnachhaltigkeit beitragen. Zusammen mit High-End-Siliziumkarbid-Lösungen wird GaN auch die Effizienz von Traktionswechselrichtern für 400-V- und 800-V-EV-Systeme vorantreiben und somit größere Reichweiten ermöglichen.\nIm Jahr 2025 und darüber hinaus wird GaN in der Robotik in großem Umfang eingesetzt werden. Das Material erhöht die Kompaktheit der Systeme und treibt die Verbreitung von Lieferdrohnen, Pflegerobotern und humanoiden Robotern weiter voran. Im Zuge der Integration von KI in der Robotik, wie der Verarbeitung natürlicher Sprache und Computer-Vision, wird GaN die für kompakte, leistungsstarke Designs erforderliche Effizienz liefern. Des Weiteren können Hersteller durch die Integration von Wechselrichtern in das Motorgehäuse auf Kühlkörper verzichten, während gleichzeitig die Verkabelung zu jedem Gelenk und jeder Achse reduziert und das EMC-Design vereinfacht wird.\nInfineon investiert weiter in die GaN-Forschung und -Entwicklung und fokussiert sich auf die Herausforderungen in Bezug auf Kosten und Skalierbarkeit. Mit dem breitesten Produkt- und IP-Portfolio, den höchsten Qualitätsstandards und führenden Innovationen wie der GaN-Wafer-Fertigung auf 300 Millimeter und der bidirektionalen Schaltertechnologie (Bidirectional Switch; BDS) stärkt das Unternehmen seine führende Rolle bei der Förderung der Dekarbonisierung und Digitalisierung auf der Grundlage aller relevanten Halbleitermaterialien, einschließlich Galliumnitrid.\nVerfügbarkeit\nDownload eBook 2025 predictions – GaN power semiconductors\nÜber Infineon\nDie Infineon Technologies AG ist ein weltweit führender Anbieter von Halbleiterlösungen für Power Systems und das Internet der Dinge (IoT). Mit seinen Produkten und Lösungen treibt Infineon die Dekarbonisierung und Digitalisierung voran. Das Unternehmen hat weltweit rund 58.060 Beschäftigte (Ende September 2024) und erzielte im Geschäftsjahr 2024 (Ende September) einen Umsatz von rund 15 Milliarden Euro. Infineon ist in Frankfurt unter dem Symbol „IFX“ und in den USA im Freiverkehrsmarkt OTCQX International unter dem Symbol „IFNNY“ notiert.\nInformationsnummer\nINFPSS202501-049\nPressefotos\n-\nDurch den Einsatz von GaN können KI-Rechenzentren eine höhere Leistungsdichte erreichen, was sich direkt auf die Menge an Rechenleistung auswirkt.CoolGaN\nJPG | 446 kb | 2126 x 2126 px",
    "article_url": "https://www.infineon.com/cms/de/about-infineon/press/market-news/2025/INFPSS202501-049.html",
    "source_url": "https://www.infineon.com/cms/en/about-infineon/press/market-news/2025/INFPSS202501-049.html"
  },
  {
    "date": "2025-01-30",
    "headline": "Infineon 2025 predictions – Gallium Nitride (GaN) semiconductors: GaN to reach adoption tipping points in multiple industries, further driving energy efficiency - Infineon Technologies",
    "content": "Infineon 2025 predictions – Gallium Nitride (GaN) semiconductors: GaN to reach adoption tipping points in multiple industries, further driving energy efficiency\nMunich, Germany – 30 January 2025 – As the world continues to face the challenges of climate change and environmental sustainability, Infineon Technologies AG (FSE: IFX / OTCQX: IFNNY) is at the forefront of innovation, harnessing the power of all relevant semiconductor materials including silicon (Si), silicon carbide (SiC), and gallium nitride (GaN) to drive meaningful progress towards decarbonization and digitalization.\nIn its 2025 predictions – GaN power semiconductors, Infineon highlights that gallium nitride will be a game-changing semiconductor material revolutionizing the way we approach energy efficiency and decarbonization across consumer, mobility, residential solar, telecommunication, and AI data center industries. GaN provides significant benefits in end customers’ applications enabling efficient performance, smaller size, lighter weight, and lower overall cost. While USB-C chargers and adapters have been the forerunners, GaN is now on its way to reaching tipping points in its adoption in further industries, substantially driving the market for GaN-based power semiconductors.\n”Infineon is committed to driving decarbonization and digitalization through innovation based on all semiconductor materials Si, SiC, and GaN,” said Johannes Schoiswohl, Head of the GaN Business Line at Infineon. “The relevance of comprehensive power systems will increase with GaN manifesting its role due to its benefits in efficiency, density, and size. Given that cost-parity with silicon is in sight, we will see an increased adoption rate for GaN this year and beyond.\nPowering AI will be highly depending on GaN. The rapid increase of required computing power and energy demand in AI data centers will drive the need for advanced solutions capable of handling the substantial loads associated with AI servers. Power supplies that once managed 3.3 kW are now evolving towards 5.5 kW, with projections moving towards 12 kW or more per unit. By leveraging GaN, AI data centers can improve power density, which directly influences the amount of computational power that can be delivered within a given rack space. While GaN presents clear advantages, hybrid approaches combining GaN with Si and SiC are ideal for meeting the requirements of AI data centers and achieving the best trade-offs between efficiency, power density and system cost.\nIn the home appliance market, Infineon expects GaN to gain significant traction, driven by the need for higher energy efficiency ratings in applications like washing machines, dryers, refrigerators and water/heat pumps. In 800 W applications, for example, GaN can enable a two percent efficiency gain, which can help manufacturers achieve the coveted A ratings. According to Infineon, GaN-based on-board chargers and DC-DC converters in electric vehicles will contribute to a higher charging efficiency, power density, and material sustainability, with a shift towards 20 kW+ systems. Together with high-end SiC solutions, GaN will also enable more efficient traction inverters for both 400 V and 800 V EV systems, contributing to an increased driving range.\nIn 2025 and beyond, robotics will see widespread adoption of GaN supported by the material's ability to enhance compactness, driving growth in delivery drones, care robots and humanoid robots. As robotics technology integrates AI advancements like natural language processing and computer vision, GaN will provide the efficiency required for compact, high-performance designs. Integrating inverters within the motor chassis eliminates the inverter heatsink while reducing cabling to each joint/axis and simplifying EMC design.\nInfineon is further pushing investment in GaN research and development to overcome the challenges of cost and scalability. With the broadest product and IP portfolio, the highest quality standards, leading-edge innovations such as 300 mm GaN wafer manufacturing and bidirectional switch (BDS) transistors, the company is bolstering its leading role in driving decarbonization and digitalization based on all relevant semiconductor materials including gallium nitride.\nAvailability\nDownload the “2025 GaN predictions” ebook here.\nインフィニオンについて\nInfineon Technologies AG is a global semiconductor leader in power systems and IoT. Infineon drives decarbonization and digitalization with its products and solutions. The Company had around 58,060 employees worldwide (end of September 2024) and generated revenue of about €15 billion in the 2024 fiscal year (ending 30 September). Infineon is listed on the Frankfurt Stock Exchange (ticker symbol: IFX) and in the USA on the OTCQX International over-the-counter market (ticker symbol: IFNNY).\nInformation Number\nINFPSS202501-049\nPress Photos\n-\nBy leveraging GaN, AI data centers can improve power density, which directly influences the amount of computational power.CoolGaN\nJPG | 446 kb | 2126 x 2126 px",
    "article_url": "https://www.infineon.com/cms/jp/about-infineon/press/market-news/2025/INFPSS202501-049.html",
    "source_url": "https://www.infineon.com/cms/en/about-infineon/press/market-news/2025/INFPSS202501-049.html"
  },
  {
    "date": "2019-02-22",
    "headline": "News - Navitas",
    "content": "Latest News\nNavitas Semiconductor to Participate in Upcoming CJS Securities Conference\nTORRANCE, CA – July 3rd, 2025, Navitas Semiconductor, the only pure-play, next-generation power semiconductor company and industry leader in gallium nitride (GaN) power ICs and silicon carbide (SiC) technology, has announced participation in the following upcoming...\nNavitas Announces Plans for 200mm GaN Production with PSMC\nNext-phase strategy expected to strengthen supply chain, drive innovation, and improve cost efficiency—supporting GaN’s ramp into AI data centers, EVs, solar, and home appliances. TORRANCE, CA – July 1st, 2025 — Navitas Semiconductor (Nasdaq: NVTS), the industry...\nVREMT Presents Navitas with ‘Outstanding Technical Collaboration Award’\nNavitas recognized for developing and delivering next-gen GaN and SiC technologies to support major automotive OEMs, including Volvo, ZEEKR, and SMART. TORRANCE, CA – June 24th, 2025 — Navitas Semiconductor (Nasdaq: NVTS), the industry leader in next-generation...\nNavitas & BrightLoop Partners to Provide Next-Generation Hydrogen Fuel-Cell Charging\nGeneSiC™ MOSFET technology enables unmatched power density for high-voltage, high-power ‘multiverters’ in fuel-cell and heavy-duty transportation. TORRANCE, CA – June 3rd, 2025 — Navitas Semiconductor (Nasdaq: NVTS), the industry leader in next-generation GaNFast™...\nNavitas Semiconductor to Participate in Upcoming Investor Events\nTORRANCE, CA – May 30, 2025, Navitas Semiconductor, the only pure-play, next-generation power semiconductor company and industry leader in gallium nitride (GaN) power ICs and silicon carbide (SiC) technology, has announced participation in the following upcoming...\nNavitas Developing Next Generation 800 V HVDC Architecture With NVIDIA\nNavitas’ GaN and SiC technologies to be developed to support NVIDIA’s 800 V HVDC data center power infrastructure for1 MW IT racks and beyond. TORRANCE, CA – May 21st, 2025 — Navitas Semiconductor (Nasdaq: NVTS), the industry leader in next-generation...\nNavitas Launches Industry-Leading 12kW GaN & SiC Platform, Achieving 97.8% Efficiency for Hyperscale AI Data Centers\nNext-generation PSU ‘designed for production’ achieves OCP requirements for high-power, high-density server racks, enabled by GaNSafe™ ICs and Gen-3 Fast SiC MOSFETs. TORRANCE, CA – May 21st, 2025—Navitas Semiconductor (Nasdaq: NVTS), the only pure-play,...\nNavitas Hosts “AI Tech Night” to Reveal Next Generation Platform for Hyperscale Data Centers\nLatest AI data center PSU platform enabled by GaNSafe™, GeneSiC™, and IntelliWeave™ will showcase industry-leading efficiency & power density for hyperscalers. TORRANCE, CA – May 15th, 2025—Navitas Semiconductor (Nasdaq: NVTS), the only pure-play, next-generation...\nNavitas Semiconductor Appoints Cristiano Amoruso to Board of Directors\nTORRANCE, Calif., May 14, 2025 - Navitas Semiconductor (Nasdaq: NVTS), the only pure-play, next-generation power semiconductor company and industry leader in gallium nitride (GaN) power ICs and silicon carbide (SiC) technology, today announced the appointment of...\nNavitas Semiconductor Announces First Quarter 2025 Financial Results\nGaN expected production ramp in new mainstream markets in AI data centers, solar micro-inverters and EV over next 12 months GaN sets industry benchmark with over 250M shipped and 100ppb field reliability SiC sets industry benchmark with reliability exceeding AEC...\nNavitas Redefines Reliability with Industry’s First Automotive ‘AEC-Plus’ Qualified SiC MOSFETs in HV-T2PaK Top-Side Cooled Package\nUnprecedented reliability combined with superior performance & optimized, high-creepage package sets a new benchmark in automotive and industrial applications. TORRANCE, CA – May 5th, 2025 — Navitas Semiconductor (Nasdaq: NVTS), the only pure-play,...\nNavitas GaNSense™ Motor Drive ICs Deliver Industry-Leading Performance, Efficiency, & Robustness in Home Appliances & Industrial Applications\nFully integrated & protected GaN ICs with bi-directional loss-less current sensing delivers 4% higher efficiency, 15% lower system cost & 40% smaller footprint. TORRANCE, CA – May 1st, 2025—Navitas Semiconductor (Nasdaq: NVTS), the only pure-play,...\nNavitas Semiconductor Announces Corporate Governance Enhancements\nRichard Hendrix Appointed Chair of the Board - Executive Steering Committee Formed to Advance Growth Strategy TORRANCE, Calif., April 24, 2025 - Navitas Semiconductor (Nasdaq: NVTS), the only pure-play, next-generation power semiconductor company and industry leader...\nNavitas Showcases Advances in GaN and SiC Technologies, Including World’s First Production Released 650V Bi-Directional GaNFast™ ICs at PCIM 2025\nLatest releases include bi-directional GaNFast ICs with IsoFast™ drivers, auto-qualified GaNSafe ICs, dedicated GaNSense Motor Drive ICs, and high-reliability SiCPAK modules. TORRANCE, CA – April 22nd, 2025—Navitas Semiconductor (Nasdaq: NVTS), the only pure-play,...\nNavitas Semiconductor to Report Q1 2025 Financial Results on Monday, May 5th, 2025\nTORRANCE, CA – April 21, 2025— Navitas Semiconductor (Nasdaq: NVTS) today announced that it will report first quarter 2025 financial results after the market close on Monday, May 5th, 2025. Management will host a conference call and live webcast to present the...\nNavitas’ Latest SiCPAK™ Power Modules Set a New Standard for Unparalleled Reliability & Efficient High-Temperature Performance\nAdvanced low-cost epoxy-resin potting technology enables 5x lower thermal resistance shift for extended system lifetime. TORRANCE, CA – April 17th, 2025 — Navitas Semiconductor (Nasdaq: NVTS), the only pure-play, next-generation power semiconductor company and...",
    "article_url": "https://navitassemi.com/news/",
    "source_url": "https://navitassemi.com/"
  },
  {
    "date": "2025-07-07",
    "headline": "Unipress orders multiple TNSC MOCVD platforms - Compound Semiconductor News",
    "content": "Unipress orders multiple TNSC MOCVD platforms\nTaiyo Nippon Sanso Corp (TSNC) has announced that the Institute of High Pressure Physics of the Polish Academy of Sciences (Unipress) will purchase and use multiple TNSC SR4000HT MOCVD reactors for its advanced nitride research and development.\n“Taiyo Nippon Sanso is very proud to establish a relationship with Unipress for research and development of advanced nitride materials and device technology. Taiyo Nippon Sanso is looking forward to working with Professor Michal Bockowski and the Unipress research community to further enhance its already great reputation as leaders in the field of nitride semiconductor research,” said TNSC senior corporate officer Kunihiro Kobayashi.\n“Unipress is very excited to partner with Taiyo Nippon Sanso. The selection of multiple TNSC SR4000HT MOCVD systems and partnership with Taiyo Nippon Sanso enables Unipress to have state-of-the-art epitaxial growth capabilities for nitrides in combination with Unipress’ established world-class GaN bulk crystal growth technologies. We are eager to leverage TNSC technology to push the boundaries of nitride semiconductor research,” said Bockowski, director of Unipress.",
    "article_url": "https://compoundsemiconductor.net/article/122071/Unipress_orders_multiple_TNSC_MOCVD_platforms",
    "source_url": "https://compoundsemiconductor.net/article/120270/Power_GaN_The_300_mm_milestone"
  },
  {
    "date": "2025-06-26",
    "headline": "Wise launches controller for GaN totem pole PFC - Compound Semiconductor News",
    "content": "Wise launches controller for GaN totem pole PFC\nWise Integration, a French pioneer in digital control for GaN and GaN IC-based power supplies, has released its first fully digital controller, WiseWare 1.1 (WIW1101) based on the MCU 32 bits.\nThe innovation enables high-frequency operation up to 2 MHz, unlocking new levels of power density, efficiency, and form factor in compact AC-DC power converters, according to the company.\n“This release marks a strategic milestone for Wise Integration’s roadmap,” said Thierry Bouchet, CEO of Wise Integration. “WiseWare 1.1 represents more than a product — it’s a key pillar in our vision to redefine power electronics through digital control. It strengthens our value proposition in high-density power conversion and reinforces our leadership as GaN technology scales to mass adoption.”\nWiseWare 1.1 uses the speed and switching capabilities of GaN through a proprietary digital control algorithm in a MCU 32 bits, that enables zero voltage switching (ZVS) across all power transistors.\nDesigned specifically for totem pole power-factor correction (PFC) architectures in critical-construction mode (CrCM), this controller allows engineers to dramatically reduce the size, weight, and thickness of magnetic components while maintaining >98 percent efficiency.\nWiseWare 1.1 supports a broad power range from 100 W to 1.5 kW, making it suitable for a wide array of modern applications requiring both compactness and high energy efficiency.\nDesigned with flexibility in mind, WiseWare 1.1 works seamlessly with standard GaN across the full RDS(on) spectrum (drain-source on-resistance), giving power designers the freedom to choose the optimal transistor for each application — without compromising performance.\nTypical applications include high-efficiency AC-DC power converters, high-power density designs, power supplies for servers, USB power delivery adapters for laptops and notebooks, and switch-mode power supplies for monitors and displays.\nThe WiseWare 1.1 platform has multiple customer design-ins and live demos at PCIM Europe. These demonstrations showcased 300W totem pole PFC converter boards using WiseWare 1.1 and WiseGan WI71060A transistors (RDS(on)=60mohms), operating from 90–264 VAC input to a 400 VDC output.",
    "article_url": "https://compoundsemiconductor.net/article/122008/Wise_launches_controller_for_GaN_totem_pole_PFC",
    "source_url": "https://compoundsemiconductor.net/article/120270/Power_GaN_The_300_mm_milestone"
  },
  {
    "date": "2025-07-03",
    "headline": "Understanding the impact of radiation on SiC devices for space - Compound Semiconductor News",
    "content": "Understanding the impact of radiation on SiC devices for space\nThe first results have been reported on a collaboration between ETH Zürich and Australia's Nuclear Science and Technology Organisation (ANSTO), looking at the impact of radiation on SiC devices for space.The results are covered in two articles both in IEEE Transactions on Nuclear Science .\nCorinna Martinella (pictured above), formerly a senior scientist at ETH Zurich, said in a LinkedIn post that the research advances an understanding of the basic mechanisms of radiation damage in SiC power devices exposed to heavy ions.\nOne paper describes how commercial SiC power devices, including MOSFETs and Junction Barrier Schottky (JBS) diodes, respond to space-like radiation at a microscopic level. By using a highly focused beam of particles at the Centre for Accelerator Science, that either travel deep or stay near the surface, Martinella and her team studied how different kinds of radiation affect the devices.\nThey found that short-range particles could cause a type of damage called single event leakage current (SELC) in both older and newer versions of these devices.\nMonte Carlo simulations performed at ANSTO helped explain how particle depth affects the damage. In particular, when particles strike certain areas of a diode, they increase the electric field and trigger a chain reaction of ionisation, which may lead to lasting defects.\nSome parts of the devices, such as the source and the gate metal lines showed no signs of damage. However, there were differences in how the devices reacted depending on whether the particle beam hit directly on the source pad or off to the side. A protective polyimide layer reduced how deeply ions could penetrate in off-pad areas.\nThe second paper investigated the relation between single event effects (SEEs) caused by heavy-Ion Irradiation and defects in SiC devices. First author student Helton De Medeiros used heavy-ion irradiation with different linear energy transfers and ion penetration ranges to investigate the radiation tolerance of SiC power diodes.\nSingle event leakage current degradation was observed for ion ranges shorter than the top crystalline layer. Other techniques were applied to explain the root cause of the observed radiation effects.\nReferences\nC. Martinella et al., 'Heavy-Ion Microbeam Studies of Single-Event Leakage Current Induced by Long- and Short-Range Particles in SiC Power Devices'; IEEE Transactions on Nuclear Science (2025)\nH. Goncalves de Medeiros et al., 'Exploring the relation between SEEs caused by heavy-ion irradiation and defects in SiC devices'; in IEEE Transactions on Nuclear Science (2025)",
    "article_url": "https://compoundsemiconductor.net/article/122060/Understanding_the_impact_of_radiation_on_SiC_devices_for_space",
    "source_url": "https://compoundsemiconductor.net/article/120270/Power_GaN_The_300_mm_milestone"
  },
  {
    "date": "2025-07-02",
    "headline": "300mm GaN roadmap",
    "content": "300mm GaN roadmap \"on track\" says Infineon\nInfineon has announced that its scalable GaN manufacturing on 300mm wafers is on track, with first samples available for customers in Q4 of 2025.\nThis means it is the first semiconductor manufacturer to successfully develop 300mm GaN power wafer technology within its existing high-volume manufacturing infrastructure,\n“Our fully scaled-up 300mm GaN manufacturing will allow us to deliver highest value to our customers even faster while moving towards cost parity for comparable silicon and GaN products,” said Johannes Schoiswohl, head of GaN Business Line at Infineon.\n“Almost a year after the announcement of Infineon’s breakthrough in 300mm GaN wafer technology, we are pleased that our transition process is well on track and that the industry has recognized the importance of Infineon’s GaN technology enabled by the strength of our IDM strategy.”\nInfineon’s manufacturing strategy relies on owning the entire semiconductor production process, from design to manufacturing and selling the final product.\nThe company’ says this in-house manufacturing strategy is a key differentiator providing several advantages such as high-quality, faster time-to-market as well as superior design and development flexibility. Infineon is committed to supporting its GaN customers and can scale capacity to meet their needs for reliable GaN power solutions.\nChip production on 300mm wafers allows 2.3 times more chips to be produced per wafer (compared to 200mm substrates). The company says its increased capabilities are needed as GaN power semiconductors are being rapidly adopted in industrial, automotive, consumer, and computing & communication applications, such as power supplies for AI systems, solar inverters, chargers and adapters or motor control systems.\nYole Group analysts expect the GaN revenue for power applications to grow by 36 percent annually to approximately US $2.5 billion by 2030.",
    "article_url": "https://compoundsemiconductor.net/article/122057/300mm_GaN_roadmap_",
    "source_url": "https://compoundsemiconductor.net/article/120270/Power_GaN_The_300_mm_milestone"
  },
  {
    "date": "2025-06-27",
    "headline": "HRL’s GaN: from innovation to qualification - Compound Semiconductor News",
    "content": "HRL’s GaN: from innovation to qualification\nMaintaining the tradition of being ‘first’ in technology innovation, HRL’s latest T3L GaN technology delivers a world-leading high-frequency performance with a process that’s manufacturable, stable, predictable and reliable.\nBY SATYAKI GANGULY, F. ERDEM ARKUN, ANDREA ARIAS-PURDUE, DAVE FANNING, ANDY FU, DMITRY VEKSLER, DAN DENNINGHOFF AND ANDREA CORRION FROM HRL LABORATORIES\nBy offering increases in power, efficiency and bandwidth over other semiconductor technologies, RF GaN devices are continuing to make a substantial impact in commercial and defence applications. But to ensure the future success of this class of device, its progress must not grind to a halt. Due to the proliferation and complexity of RF signals, the electromagnetic environment is increasingly crowded, driving urgent demand for GaN technologies operating at higher frequencies – and in particular, the millimetre-wave range that spans 30 GHz to 300 GHz.\nMeeting this need is not trivial. It requires a rethinking of GaN materials and fabrication approaches, including a move away from many of the standard features incorporated into lower-frequency technologies, such as standard annealed ohmic contacts, large field-plates to manage electric fields, and the standard AlGaN/GaN HEMT epitaxial structure.\nUnfortunately, those that take on the challenge of moving to higher frequencies also come up against a number of trade-offs. To give just one example, when decreasing the gate length to sub-100-nm dimensions and eliminating field plates to enable high-frequency operation, peak electric fields in the device increase, impeding reliability. What’s needed are out-of-the box, innovative solutions.\nFigure 1: The evolution of HRL’s millimeter-wave GaN foundry offerings over time.\nAt HRL Laboratories, LLC, we have a long history of exceling on this front. By redefining the boundaries of what’s possible today, we invent solutions to tomorrow’s problems. Employing an ownership model that prioritises purpose over profit, we invest in ambitious ideas and take strategic risks on projects that significantly advance the state of the art, pursuing paths that others might overlook. This culture is reflected in our legacy of groundbreaking work on high-frequency GaN.\nFor many years, our portfolio of millimetre-wave GaN devices and circuits has featured cutting-edge innovations that break performance trade-offs and push the boundaries for high-frequency GaN. One of our latest technology nodes – T3L GaN – builds upon our previous successes, while adding innovations that ensure high linearity and reliability, such as a graded epitaxial structure and a gate mini-field-plate. In recent times, we have also invested tremendous effort into GaN technology maturation, qualification, model development, and external foundry services. The result is that today we are offering GaN with world-leading high-frequency performance – such as T3L – to external designers via reliable, mature, open foundry offerings.\nHRL GaN odyssey\nWe have been investing in GaN materials, transistors, and circuit development since the late 1990s, and we have a long history of ‘firsts’ for RF GaN MMICs, particularly in high-frequency technology demonstrations.\nOur early investments associated with in-house epitaxial growth capability enabled innovations such as n+ GaN ohmic contact regrowth by MBE, and vertically scaled layer structures necessary for high-frequency performance.\nAs we continue to develop and advance our GaN technology, we draw on our extensive expertise in high-frequency MMIC design and fabrication. Our background includes a strong track record as a provider of high-frequency GaAs and InP-based circuits.\nKey milestones in GaN RF technology include unveiling the first Ka-band GaN MMIC power amplifier at the 2004 IEEE International Microwave Symposium, the first W-band GaN MMIC power amplifier at the 2006 International Electron Devices Meeting, and the first G-band GaN MMIC at the 2014 IEEE Symposium on Compound Semiconductor Integrated Circuits.\nFigure 2. For Ka-band amplifiers linearity versus DC power consumption with typical linearity FOM of around 0 dB has been shown. Star represents the fiducial point illustrating HRL’s T3L GaN linearity that sets HRL apart. Adapted from J. -S. Moon et al. International Microwave Symposium - IMS 2022, pp. 302-304, 2022.\nOver the years, our high-frequency GaN technology nodes – which have utilised ‘T’-gates, as opposed to gamma- or field-plate gates – have targeted progressively higher-frequency operation (see Figure 1). Our T3L node is built upon our 40 nm-gate T3 node, but features key modifications to improve linearity and dynamic range – this results in an enviable combination of outstanding linearity, noise, output power, and efficiency for millimetre-wave applications. Much of this pioneering work in high-frequency GaN was made possible through financial support from the US government, with programmes such as DARPA WBGS, DARPA NEXT, and DARPA DREAM, among others.\nHRL T3L GaN technology\nOur T3L GaN HEMT technology was initially developed under DARPA’s Dynamic Range-enhanced Electronics and Materials (DREaM) programme, which had the goal of developing new designs and materials for RF transistors with an unprecedented dynamic range in millimetre-wave systems. To succeed in this endeavour, we combined a graded-channel AlGaN/GaN epitaxial structure, providing precise control of transistor transconductance, with a scaled 40-nm T-gate and mini-field-plate. One of the key merits of the graded-channel epi and mini-field-plate is a distribution of the electric field across the device’s active area that improves linearity and reduces signal distortion – that’s particularly beneficial for high-frequency applications, where RF signal integrity and linearity are crucial. Meanwhile, the short gate length supports a high cut-off frequency (fT) of 170 GHz, and a maximum oscillation frequency (fMAX) of 347 GHz.\nDrawing on these strengths, our GaN MMICs that incorporate the T3L transistor technology and on-chip pre-matching networks have demonstrated a world-record peak power-added efficiency of 45 percent at 94 GHz, and a corresponding power density of more than 2 W mm-1. These two characteristics are key performance metrics for efficient power amplifiers. The power-added efficiency of our GaN MMICs at 30 GHz is world-beating, with values as high as 70 percent.\nModern-day phased arrays and high-dynamic-range RF front ends require amplifiers with high linearity. Traditionally, this linearity requirement has been fulfilled with low-noise amplifiers, operating with a higher DC power consumption, or power amplifiers that are run at a reduced power-added efficiency and power density.\nFigure 3. Three-temperature accelerated life (3T-ALT), high-temperature reverse-bias (HTRB), and RF high-temperature operating life (RF-HTOL) tests of HRL’s T3L GaN. (a) Median-time-to-failure (MTTF) versus junction temperature for T3L GaN discrete devices under DC-ALT stress. Red data points represent the extracted MTTF values at the stress temperatures, while the green solid line is the fit and extrapolation as described in the text. The star represents the fiducial point to illustrate the predicted MTTF lifetime at the junction temperature, Tj, of 150 °C, of more than 1 x 107 hours. (b) Threshold voltage of discrete devices during HTRB stress and (c) RF output power (Pout) during HTOL stress, both showing excellent stability up to at least 1000 hours.\nNeither of these options is preferable. Industry is reluctant to meet linearity requirements by taking a hit in efficiency or consuming more power, especially as payload power needs to be allocated to increased bandwidth and newer software-defined features. Moreover, many airborne platforms are size, weight and power (SWaP) constrained.\nWhat’s urgently needed are devices with a high linearity-to-power-consumption figure-of-merit. In this regard, a common figure-of-merit for benchmarking is the ratio of the Output Third-Order Intercept Point (OIP3) (a measure of linearity) to DC power consumption. Judged against this metric, known for short as OIP3/PDC, our T3L GaN technology that employs key design and process breakthroughs delivers a record 17.5 dB at 30 GHz. That’s a jaw-dropping improvement, more than 30 times better than the best previous Ka-band low-noise amplifiers featuring GaAs pHEMTs and AlGaN/GaN HEMTs (see Figure 2).\nKey features of our T3L GaN technology include two-level metal interconnects with 5 µm plated airbridges, 50 Ω/sq. thin-film resistors, 300 fF mm-2 metal insulator metal capacitors, and 50 mm SiC with through-substrate vias and backside metal.\nOur T3L GaN is well-positioned for success in a range of cutting-edge applications within the millimetre-wave domain. Deploying our technology in 5G and beyond wireless communication enables faster data transmission and improved signal quality; in high-resolution radar systems, T3L GaN provides better target detection and imaging capabilities; in electronic warfare and defence systems, T3L GaN enables robust performance in challenging environments; and last but not least, in satellite communications T3L GaN ensures reliable, efficient signal transmission over long distances.\nT3L GaN technology qualification\nRecently, we have invested heavily in the qualification and maturation of our RF GaN technology, to meet the ever-growing demand and requirements of key strategic customers. Lifetime assessment is the first step towards meeting such expectations.\nThe first inception of our T3L GaN on the DARPA DREaM programme demonstrated the tremendous potential of our technology. Since then, by devoting much effort to technology maturation and qualification, we have been led to implement several minor proprietary changes to the epitaxial structure and fabrication processes, to further improve yield, manufacturability, and reliability.\nTo understand the lifetime of our first-in-class sub-100-nm GaN HEMTs, we have undertaken temperature-accelerated lifetime testing on our 4 x 37.5 µm T3L GaN discrete transistors with a dissipated power of around 4 W mm-1 and junction temperatures ranging from 300 °C to 380 °C (results are shown in Figure 3). Note that, to drive devices to failure, we have intentionally employed stress temperatures that are far higher than the recommended operating condition, which typically ranges from 150 °C to 225 °C.\nFor this study, we defined the failure criteria as a 20 percent degradation in device on-resistancefrom its initial value. To determine values for the median-time-to-fail (MTTF) and lifetime, we analysed the failure time distribution with an Arrhenius temperature-accelerated lifetime model, lognormal statistics, and maximum likelihood estimation.\nBased on this approach, we find that despite having one of the shortest gate lengths in the GaN industry, our T3L device lifetime is no shorter than 100 years at a junction temperature of 150 °C. This is a MTTF benchmark that other GaN manufacturers typically strive for.\nIn addition to temperature-accelerated life testing, we have also performed off-state high temperature reverse-bias (HTRB) and on-state RF high temperature operating life (RF-HTOL) reliability testing on T3L devices (see Figure 3). For HTRB testing at an ambient temperature of 150 °C, we stressed a group of discrete transistors from multiple wafers using a gate bias of -7 V and a drain bias of 35 V, which corresponds to 250 percent of the operating quiescent voltage (14 V). Under these conditions, we evaluated the stability of various device parameters, such as the threshold voltage.\nApplying these conditions for HTRB testing, we determined that device performance is stable up to at least 1000 hours. This is a key reliability benchmark.\nOn-state qualification of our T3L MMICs through RF-HTOL stress also showed excellent stability, with minimal shift in critical RF-paraments after 1000 hours of stressing.\nSuccessfully passing 1,000 hours of HTRB and RF-HTOL testing, in addition to hitting the state-of-the-art MTTF benchmark, serves as a testament to our stable, predictable, and reliable GaN T3L process.\nNote that our GaN manufacturing process aligns with a remark made by one of the fathers of statistical process control, the US engineer Harold Dodge, who is famous for the phrase ‘you cannot inspect quality into a product’. The implication of his statement is that it’s critical to build quality and reliability into the product during the manufacturing process. Abiding by this philosophy, we do not implement any additional burn-in or screening when choosing devices for reliability testing. Instead, all our reliability results come from devices randomly picked across multiple wafers after fabrication.\nAccording to a T3L GaN wafer map of peak fT and gate leakage current, tested on in-line process control monitors, there is excellent uniformity associated with our T3L GaN process fabricated on a 100 mm SiC wafer (see Figure 4, which has an inset that shows a schematic cross-section of a W-band capable T3L GaN transistor, as well as a corresponding scanning electron microscopy image).\nFigure 4. Wafer map of a typical T3L GaN (gate length less than 100 nm, source-to drain of 900 nm) showing uniform peak fT at a VDS of 5 V and gate leakage current density measured at VDS = 8 V and VGS = -5 V. Schematic cross section and the corresponding scanning electron microscopy image of a representative T3L GaN transistor taken from such a wafer is shown in the inset.\nTechnology maturation and foundry service\nWe are the first fab (ISO 9001 certified) to develop and offer a sub-100 nm GaN MMIC process technology through our foundry services. With US government support, in 2019 we launched an open commercial multi-project-wafer (MPW) foundry service for our 40 nm GaN-on-SiC T3 technology, and since 2021 we have offered quarterly MPW runs. To-date, we have sold 86 MPW tiles to 30 unique customers. Our foundry services include process design kits (PDKs) in both ADS and AWR, secure management of customers’ design verification, wafer microfabrication, RF probing, and the delivery of singulated MMICs.\nTo continue to advance our T3L technology node, this year we are launching a T3L GaN MPW service, and adding advanced interconnect features, such as copper pillars for flip-chip compatibility.\nHistorically, our GaN foundry interests have been balanced across research institutions, companies in the aerospace and defence sector, and commercial private-sector entities. Thanks to the maturation of our sub-100 nm GaN processes, we have seen increasing demand, especially for applications in the V/W-bands. Customers are encouraged to engage with our open foundry for GaN PDK and device model access and support for low-to-moderate volume production.\nBeyond T3L GaN\nIn addition to our T3L RF-GaN technologies, we continue to innovate, motivated by the goal of pushing the boundaries of future technologies that will be transformative for the warfighter. One such innovation is N-Polar GaN, a technology we are exploring for its potential to deliver higher power. N-Polar GaN is showing promising capabilities compared with traditional GaN, but it is still advancing through the maturity stages, supported by early government investments in both academia and industry.\nWe are also making strides in the Ultra-Wide Bandgap Semiconductors (UWBGS) programme that’s funded by DARPA. This initiative focuses on developing key processes for realising next-generation devices, including high-efficiency UVC LEDs, laser diodes, high-power RF transistors, and power-conversion electronics.\nThrough these efforts, we continue to position ourselves at the forefront of technological advancements that will shape the future of military and commercial applications.\nBy combining world-record efficiency, output power, linearity, and noise figures with excellent device reliability, stability, and uniformity, our current GaN technology is uniquely positioned to address rapidly evolving needs in the millimetre-wave RF application space. On top of that, our heavy investment in maturation and capacity to support customer engagements is ensuring a bright future for our GaN, and helping to continueto shape the future of GaN for the broader community.\nHRL Laboratories conducts contract research and development with support from various US government agencies, including DARPA, US Air Force, OUSD, and ONR. The organisation gratefully acknowledges this vital support in driving the advancement of cutting-edge technologies and scientific innovation.",
    "article_url": "https://compoundsemiconductor.net/article/122009/HRL’s_GaN_from_innovation_to_qualification",
    "source_url": "https://compoundsemiconductor.net/article/120270/Power_GaN_The_300_mm_milestone"
  },
  {
    "date": "2025-07-07",
    "headline": "Unipress orders multiple TNSC MOCVD platforms - Compound Semiconductor News",
    "content": "Unipress orders multiple TNSC MOCVD platforms\nTaiyo Nippon Sanso Corp (TSNC) has announced that the Institute of High Pressure Physics of the Polish Academy of Sciences (Unipress) will purchase and use multiple TNSC SR4000HT MOCVD reactors for its advanced nitride research and development.\n“Taiyo Nippon Sanso is very proud to establish a relationship with Unipress for research and development of advanced nitride materials and device technology. Taiyo Nippon Sanso is looking forward to working with Professor Michal Bockowski and the Unipress research community to further enhance its already great reputation as leaders in the field of nitride semiconductor research,” said TNSC senior corporate officer Kunihiro Kobayashi.\n“Unipress is very excited to partner with Taiyo Nippon Sanso. The selection of multiple TNSC SR4000HT MOCVD systems and partnership with Taiyo Nippon Sanso enables Unipress to have state-of-the-art epitaxial growth capabilities for nitrides in combination with Unipress’ established world-class GaN bulk crystal growth technologies. We are eager to leverage TNSC technology to push the boundaries of nitride semiconductor research,” said Bockowski, director of Unipress.",
    "article_url": "https://compoundsemiconductor.net/article/122071/Unipress_orders_multiple_TNSC_MOCVD_platforms",
    "source_url": "https://compoundsemiconductor.net/article/120717/Advancing_GaN_power_devices_with_ammonia_MBE"
  },
  {
    "date": "2025-06-26",
    "headline": "Wise launches controller for GaN totem pole PFC - Compound Semiconductor News",
    "content": "Wise launches controller for GaN totem pole PFC\nWise Integration, a French pioneer in digital control for GaN and GaN IC-based power supplies, has released its first fully digital controller, WiseWare 1.1 (WIW1101) based on the MCU 32 bits.\nThe innovation enables high-frequency operation up to 2 MHz, unlocking new levels of power density, efficiency, and form factor in compact AC-DC power converters, according to the company.\n“This release marks a strategic milestone for Wise Integration’s roadmap,” said Thierry Bouchet, CEO of Wise Integration. “WiseWare 1.1 represents more than a product — it’s a key pillar in our vision to redefine power electronics through digital control. It strengthens our value proposition in high-density power conversion and reinforces our leadership as GaN technology scales to mass adoption.”\nWiseWare 1.1 uses the speed and switching capabilities of GaN through a proprietary digital control algorithm in a MCU 32 bits, that enables zero voltage switching (ZVS) across all power transistors.\nDesigned specifically for totem pole power-factor correction (PFC) architectures in critical-construction mode (CrCM), this controller allows engineers to dramatically reduce the size, weight, and thickness of magnetic components while maintaining >98 percent efficiency.\nWiseWare 1.1 supports a broad power range from 100 W to 1.5 kW, making it suitable for a wide array of modern applications requiring both compactness and high energy efficiency.\nDesigned with flexibility in mind, WiseWare 1.1 works seamlessly with standard GaN across the full RDS(on) spectrum (drain-source on-resistance), giving power designers the freedom to choose the optimal transistor for each application — without compromising performance.\nTypical applications include high-efficiency AC-DC power converters, high-power density designs, power supplies for servers, USB power delivery adapters for laptops and notebooks, and switch-mode power supplies for monitors and displays.\nThe WiseWare 1.1 platform has multiple customer design-ins and live demos at PCIM Europe. These demonstrations showcased 300W totem pole PFC converter boards using WiseWare 1.1 and WiseGan WI71060A transistors (RDS(on)=60mohms), operating from 90–264 VAC input to a 400 VDC output.",
    "article_url": "https://compoundsemiconductor.net/article/122008/Wise_launches_controller_for_GaN_totem_pole_PFC",
    "source_url": "https://compoundsemiconductor.net/article/120717/Advancing_GaN_power_devices_with_ammonia_MBE"
  },
  {
    "date": "2025-07-03",
    "headline": "Understanding the impact of radiation on SiC devices for space - Compound Semiconductor News",
    "content": "Understanding the impact of radiation on SiC devices for space\nThe first results have been reported on a collaboration between ETH Zürich and Australia's Nuclear Science and Technology Organisation (ANSTO), looking at the impact of radiation on SiC devices for space.The results are covered in two articles both in IEEE Transactions on Nuclear Science .\nCorinna Martinella (pictured above), formerly a senior scientist at ETH Zurich, said in a LinkedIn post that the research advances an understanding of the basic mechanisms of radiation damage in SiC power devices exposed to heavy ions.\nOne paper describes how commercial SiC power devices, including MOSFETs and Junction Barrier Schottky (JBS) diodes, respond to space-like radiation at a microscopic level. By using a highly focused beam of particles at the Centre for Accelerator Science, that either travel deep or stay near the surface, Martinella and her team studied how different kinds of radiation affect the devices.\nThey found that short-range particles could cause a type of damage called single event leakage current (SELC) in both older and newer versions of these devices.\nMonte Carlo simulations performed at ANSTO helped explain how particle depth affects the damage. In particular, when particles strike certain areas of a diode, they increase the electric field and trigger a chain reaction of ionisation, which may lead to lasting defects.\nSome parts of the devices, such as the source and the gate metal lines showed no signs of damage. However, there were differences in how the devices reacted depending on whether the particle beam hit directly on the source pad or off to the side. A protective polyimide layer reduced how deeply ions could penetrate in off-pad areas.\nThe second paper investigated the relation between single event effects (SEEs) caused by heavy-Ion Irradiation and defects in SiC devices. First author student Helton De Medeiros used heavy-ion irradiation with different linear energy transfers and ion penetration ranges to investigate the radiation tolerance of SiC power diodes.\nSingle event leakage current degradation was observed for ion ranges shorter than the top crystalline layer. Other techniques were applied to explain the root cause of the observed radiation effects.\nReferences\nC. Martinella et al., 'Heavy-Ion Microbeam Studies of Single-Event Leakage Current Induced by Long- and Short-Range Particles in SiC Power Devices'; IEEE Transactions on Nuclear Science (2025)\nH. Goncalves de Medeiros et al., 'Exploring the relation between SEEs caused by heavy-ion irradiation and defects in SiC devices'; in IEEE Transactions on Nuclear Science (2025)",
    "article_url": "https://compoundsemiconductor.net/article/122060/Understanding_the_impact_of_radiation_on_SiC_devices_for_space",
    "source_url": "https://compoundsemiconductor.net/article/120717/Advancing_GaN_power_devices_with_ammonia_MBE"
  },
  {
    "date": "2025-07-02",
    "headline": "300mm GaN roadmap",
    "content": "300mm GaN roadmap \"on track\" says Infineon\nInfineon has announced that its scalable GaN manufacturing on 300mm wafers is on track, with first samples available for customers in Q4 of 2025.\nThis means it is the first semiconductor manufacturer to successfully develop 300mm GaN power wafer technology within its existing high-volume manufacturing infrastructure,\n“Our fully scaled-up 300mm GaN manufacturing will allow us to deliver highest value to our customers even faster while moving towards cost parity for comparable silicon and GaN products,” said Johannes Schoiswohl, head of GaN Business Line at Infineon.\n“Almost a year after the announcement of Infineon’s breakthrough in 300mm GaN wafer technology, we are pleased that our transition process is well on track and that the industry has recognized the importance of Infineon’s GaN technology enabled by the strength of our IDM strategy.”\nInfineon’s manufacturing strategy relies on owning the entire semiconductor production process, from design to manufacturing and selling the final product.\nThe company’ says this in-house manufacturing strategy is a key differentiator providing several advantages such as high-quality, faster time-to-market as well as superior design and development flexibility. Infineon is committed to supporting its GaN customers and can scale capacity to meet their needs for reliable GaN power solutions.\nChip production on 300mm wafers allows 2.3 times more chips to be produced per wafer (compared to 200mm substrates). The company says its increased capabilities are needed as GaN power semiconductors are being rapidly adopted in industrial, automotive, consumer, and computing & communication applications, such as power supplies for AI systems, solar inverters, chargers and adapters or motor control systems.\nYole Group analysts expect the GaN revenue for power applications to grow by 36 percent annually to approximately US $2.5 billion by 2030.",
    "article_url": "https://compoundsemiconductor.net/article/122057/300mm_GaN_roadmap_",
    "source_url": "https://compoundsemiconductor.net/article/120717/Advancing_GaN_power_devices_with_ammonia_MBE"
  },
  {
    "date": "2025-06-27",
    "headline": "HRL’s GaN: from innovation to qualification - Compound Semiconductor News",
    "content": "HRL’s GaN: from innovation to qualification\nMaintaining the tradition of being ‘first’ in technology innovation, HRL’s latest T3L GaN technology delivers a world-leading high-frequency performance with a process that’s manufacturable, stable, predictable and reliable.\nBY SATYAKI GANGULY, F. ERDEM ARKUN, ANDREA ARIAS-PURDUE, DAVE FANNING, ANDY FU, DMITRY VEKSLER, DAN DENNINGHOFF AND ANDREA CORRION FROM HRL LABORATORIES\nBy offering increases in power, efficiency and bandwidth over other semiconductor technologies, RF GaN devices are continuing to make a substantial impact in commercial and defence applications. But to ensure the future success of this class of device, its progress must not grind to a halt. Due to the proliferation and complexity of RF signals, the electromagnetic environment is increasingly crowded, driving urgent demand for GaN technologies operating at higher frequencies – and in particular, the millimetre-wave range that spans 30 GHz to 300 GHz.\nMeeting this need is not trivial. It requires a rethinking of GaN materials and fabrication approaches, including a move away from many of the standard features incorporated into lower-frequency technologies, such as standard annealed ohmic contacts, large field-plates to manage electric fields, and the standard AlGaN/GaN HEMT epitaxial structure.\nUnfortunately, those that take on the challenge of moving to higher frequencies also come up against a number of trade-offs. To give just one example, when decreasing the gate length to sub-100-nm dimensions and eliminating field plates to enable high-frequency operation, peak electric fields in the device increase, impeding reliability. What’s needed are out-of-the box, innovative solutions.\nFigure 1: The evolution of HRL’s millimeter-wave GaN foundry offerings over time.\nAt HRL Laboratories, LLC, we have a long history of exceling on this front. By redefining the boundaries of what’s possible today, we invent solutions to tomorrow’s problems. Employing an ownership model that prioritises purpose over profit, we invest in ambitious ideas and take strategic risks on projects that significantly advance the state of the art, pursuing paths that others might overlook. This culture is reflected in our legacy of groundbreaking work on high-frequency GaN.\nFor many years, our portfolio of millimetre-wave GaN devices and circuits has featured cutting-edge innovations that break performance trade-offs and push the boundaries for high-frequency GaN. One of our latest technology nodes – T3L GaN – builds upon our previous successes, while adding innovations that ensure high linearity and reliability, such as a graded epitaxial structure and a gate mini-field-plate. In recent times, we have also invested tremendous effort into GaN technology maturation, qualification, model development, and external foundry services. The result is that today we are offering GaN with world-leading high-frequency performance – such as T3L – to external designers via reliable, mature, open foundry offerings.\nHRL GaN odyssey\nWe have been investing in GaN materials, transistors, and circuit development since the late 1990s, and we have a long history of ‘firsts’ for RF GaN MMICs, particularly in high-frequency technology demonstrations.\nOur early investments associated with in-house epitaxial growth capability enabled innovations such as n+ GaN ohmic contact regrowth by MBE, and vertically scaled layer structures necessary for high-frequency performance.\nAs we continue to develop and advance our GaN technology, we draw on our extensive expertise in high-frequency MMIC design and fabrication. Our background includes a strong track record as a provider of high-frequency GaAs and InP-based circuits.\nKey milestones in GaN RF technology include unveiling the first Ka-band GaN MMIC power amplifier at the 2004 IEEE International Microwave Symposium, the first W-band GaN MMIC power amplifier at the 2006 International Electron Devices Meeting, and the first G-band GaN MMIC at the 2014 IEEE Symposium on Compound Semiconductor Integrated Circuits.\nFigure 2. For Ka-band amplifiers linearity versus DC power consumption with typical linearity FOM of around 0 dB has been shown. Star represents the fiducial point illustrating HRL’s T3L GaN linearity that sets HRL apart. Adapted from J. -S. Moon et al. International Microwave Symposium - IMS 2022, pp. 302-304, 2022.\nOver the years, our high-frequency GaN technology nodes – which have utilised ‘T’-gates, as opposed to gamma- or field-plate gates – have targeted progressively higher-frequency operation (see Figure 1). Our T3L node is built upon our 40 nm-gate T3 node, but features key modifications to improve linearity and dynamic range – this results in an enviable combination of outstanding linearity, noise, output power, and efficiency for millimetre-wave applications. Much of this pioneering work in high-frequency GaN was made possible through financial support from the US government, with programmes such as DARPA WBGS, DARPA NEXT, and DARPA DREAM, among others.\nHRL T3L GaN technology\nOur T3L GaN HEMT technology was initially developed under DARPA’s Dynamic Range-enhanced Electronics and Materials (DREaM) programme, which had the goal of developing new designs and materials for RF transistors with an unprecedented dynamic range in millimetre-wave systems. To succeed in this endeavour, we combined a graded-channel AlGaN/GaN epitaxial structure, providing precise control of transistor transconductance, with a scaled 40-nm T-gate and mini-field-plate. One of the key merits of the graded-channel epi and mini-field-plate is a distribution of the electric field across the device’s active area that improves linearity and reduces signal distortion – that’s particularly beneficial for high-frequency applications, where RF signal integrity and linearity are crucial. Meanwhile, the short gate length supports a high cut-off frequency (fT) of 170 GHz, and a maximum oscillation frequency (fMAX) of 347 GHz.\nDrawing on these strengths, our GaN MMICs that incorporate the T3L transistor technology and on-chip pre-matching networks have demonstrated a world-record peak power-added efficiency of 45 percent at 94 GHz, and a corresponding power density of more than 2 W mm-1. These two characteristics are key performance metrics for efficient power amplifiers. The power-added efficiency of our GaN MMICs at 30 GHz is world-beating, with values as high as 70 percent.\nModern-day phased arrays and high-dynamic-range RF front ends require amplifiers with high linearity. Traditionally, this linearity requirement has been fulfilled with low-noise amplifiers, operating with a higher DC power consumption, or power amplifiers that are run at a reduced power-added efficiency and power density.\nFigure 3. Three-temperature accelerated life (3T-ALT), high-temperature reverse-bias (HTRB), and RF high-temperature operating life (RF-HTOL) tests of HRL’s T3L GaN. (a) Median-time-to-failure (MTTF) versus junction temperature for T3L GaN discrete devices under DC-ALT stress. Red data points represent the extracted MTTF values at the stress temperatures, while the green solid line is the fit and extrapolation as described in the text. The star represents the fiducial point to illustrate the predicted MTTF lifetime at the junction temperature, Tj, of 150 °C, of more than 1 x 107 hours. (b) Threshold voltage of discrete devices during HTRB stress and (c) RF output power (Pout) during HTOL stress, both showing excellent stability up to at least 1000 hours.\nNeither of these options is preferable. Industry is reluctant to meet linearity requirements by taking a hit in efficiency or consuming more power, especially as payload power needs to be allocated to increased bandwidth and newer software-defined features. Moreover, many airborne platforms are size, weight and power (SWaP) constrained.\nWhat’s urgently needed are devices with a high linearity-to-power-consumption figure-of-merit. In this regard, a common figure-of-merit for benchmarking is the ratio of the Output Third-Order Intercept Point (OIP3) (a measure of linearity) to DC power consumption. Judged against this metric, known for short as OIP3/PDC, our T3L GaN technology that employs key design and process breakthroughs delivers a record 17.5 dB at 30 GHz. That’s a jaw-dropping improvement, more than 30 times better than the best previous Ka-band low-noise amplifiers featuring GaAs pHEMTs and AlGaN/GaN HEMTs (see Figure 2).\nKey features of our T3L GaN technology include two-level metal interconnects with 5 µm plated airbridges, 50 Ω/sq. thin-film resistors, 300 fF mm-2 metal insulator metal capacitors, and 50 mm SiC with through-substrate vias and backside metal.\nOur T3L GaN is well-positioned for success in a range of cutting-edge applications within the millimetre-wave domain. Deploying our technology in 5G and beyond wireless communication enables faster data transmission and improved signal quality; in high-resolution radar systems, T3L GaN provides better target detection and imaging capabilities; in electronic warfare and defence systems, T3L GaN enables robust performance in challenging environments; and last but not least, in satellite communications T3L GaN ensures reliable, efficient signal transmission over long distances.\nT3L GaN technology qualification\nRecently, we have invested heavily in the qualification and maturation of our RF GaN technology, to meet the ever-growing demand and requirements of key strategic customers. Lifetime assessment is the first step towards meeting such expectations.\nThe first inception of our T3L GaN on the DARPA DREaM programme demonstrated the tremendous potential of our technology. Since then, by devoting much effort to technology maturation and qualification, we have been led to implement several minor proprietary changes to the epitaxial structure and fabrication processes, to further improve yield, manufacturability, and reliability.\nTo understand the lifetime of our first-in-class sub-100-nm GaN HEMTs, we have undertaken temperature-accelerated lifetime testing on our 4 x 37.5 µm T3L GaN discrete transistors with a dissipated power of around 4 W mm-1 and junction temperatures ranging from 300 °C to 380 °C (results are shown in Figure 3). Note that, to drive devices to failure, we have intentionally employed stress temperatures that are far higher than the recommended operating condition, which typically ranges from 150 °C to 225 °C.\nFor this study, we defined the failure criteria as a 20 percent degradation in device on-resistancefrom its initial value. To determine values for the median-time-to-fail (MTTF) and lifetime, we analysed the failure time distribution with an Arrhenius temperature-accelerated lifetime model, lognormal statistics, and maximum likelihood estimation.\nBased on this approach, we find that despite having one of the shortest gate lengths in the GaN industry, our T3L device lifetime is no shorter than 100 years at a junction temperature of 150 °C. This is a MTTF benchmark that other GaN manufacturers typically strive for.\nIn addition to temperature-accelerated life testing, we have also performed off-state high temperature reverse-bias (HTRB) and on-state RF high temperature operating life (RF-HTOL) reliability testing on T3L devices (see Figure 3). For HTRB testing at an ambient temperature of 150 °C, we stressed a group of discrete transistors from multiple wafers using a gate bias of -7 V and a drain bias of 35 V, which corresponds to 250 percent of the operating quiescent voltage (14 V). Under these conditions, we evaluated the stability of various device parameters, such as the threshold voltage.\nApplying these conditions for HTRB testing, we determined that device performance is stable up to at least 1000 hours. This is a key reliability benchmark.\nOn-state qualification of our T3L MMICs through RF-HTOL stress also showed excellent stability, with minimal shift in critical RF-paraments after 1000 hours of stressing.\nSuccessfully passing 1,000 hours of HTRB and RF-HTOL testing, in addition to hitting the state-of-the-art MTTF benchmark, serves as a testament to our stable, predictable, and reliable GaN T3L process.\nNote that our GaN manufacturing process aligns with a remark made by one of the fathers of statistical process control, the US engineer Harold Dodge, who is famous for the phrase ‘you cannot inspect quality into a product’. The implication of his statement is that it’s critical to build quality and reliability into the product during the manufacturing process. Abiding by this philosophy, we do not implement any additional burn-in or screening when choosing devices for reliability testing. Instead, all our reliability results come from devices randomly picked across multiple wafers after fabrication.\nAccording to a T3L GaN wafer map of peak fT and gate leakage current, tested on in-line process control monitors, there is excellent uniformity associated with our T3L GaN process fabricated on a 100 mm SiC wafer (see Figure 4, which has an inset that shows a schematic cross-section of a W-band capable T3L GaN transistor, as well as a corresponding scanning electron microscopy image).\nFigure 4. Wafer map of a typical T3L GaN (gate length less than 100 nm, source-to drain of 900 nm) showing uniform peak fT at a VDS of 5 V and gate leakage current density measured at VDS = 8 V and VGS = -5 V. Schematic cross section and the corresponding scanning electron microscopy image of a representative T3L GaN transistor taken from such a wafer is shown in the inset.\nTechnology maturation and foundry service\nWe are the first fab (ISO 9001 certified) to develop and offer a sub-100 nm GaN MMIC process technology through our foundry services. With US government support, in 2019 we launched an open commercial multi-project-wafer (MPW) foundry service for our 40 nm GaN-on-SiC T3 technology, and since 2021 we have offered quarterly MPW runs. To-date, we have sold 86 MPW tiles to 30 unique customers. Our foundry services include process design kits (PDKs) in both ADS and AWR, secure management of customers’ design verification, wafer microfabrication, RF probing, and the delivery of singulated MMICs.\nTo continue to advance our T3L technology node, this year we are launching a T3L GaN MPW service, and adding advanced interconnect features, such as copper pillars for flip-chip compatibility.\nHistorically, our GaN foundry interests have been balanced across research institutions, companies in the aerospace and defence sector, and commercial private-sector entities. Thanks to the maturation of our sub-100 nm GaN processes, we have seen increasing demand, especially for applications in the V/W-bands. Customers are encouraged to engage with our open foundry for GaN PDK and device model access and support for low-to-moderate volume production.\nBeyond T3L GaN\nIn addition to our T3L RF-GaN technologies, we continue to innovate, motivated by the goal of pushing the boundaries of future technologies that will be transformative for the warfighter. One such innovation is N-Polar GaN, a technology we are exploring for its potential to deliver higher power. N-Polar GaN is showing promising capabilities compared with traditional GaN, but it is still advancing through the maturity stages, supported by early government investments in both academia and industry.\nWe are also making strides in the Ultra-Wide Bandgap Semiconductors (UWBGS) programme that’s funded by DARPA. This initiative focuses on developing key processes for realising next-generation devices, including high-efficiency UVC LEDs, laser diodes, high-power RF transistors, and power-conversion electronics.\nThrough these efforts, we continue to position ourselves at the forefront of technological advancements that will shape the future of military and commercial applications.\nBy combining world-record efficiency, output power, linearity, and noise figures with excellent device reliability, stability, and uniformity, our current GaN technology is uniquely positioned to address rapidly evolving needs in the millimetre-wave RF application space. On top of that, our heavy investment in maturation and capacity to support customer engagements is ensuring a bright future for our GaN, and helping to continueto shape the future of GaN for the broader community.\nHRL Laboratories conducts contract research and development with support from various US government agencies, including DARPA, US Air Force, OUSD, and ONR. The organisation gratefully acknowledges this vital support in driving the advancement of cutting-edge technologies and scientific innovation.",
    "article_url": "https://compoundsemiconductor.net/article/122009/HRL’s_GaN_from_innovation_to_qualification",
    "source_url": "https://compoundsemiconductor.net/article/120717/Advancing_GaN_power_devices_with_ammonia_MBE"
  },
  {
    "date": "2025-07-06",
    "headline": "News tagged robotics at DIGITIMES",
    "content": "Yamaha Motor is accelerating its pivot into the semiconductor equipment space with the launch of Yamaha Robotics, a newly established division focused on robotic systems for electronics...\nAs US President Donald Trump intensifies rare earth export negotiations with China, Beijing is countering with a media blitz to highlight its rising independence from US semiconductor...\nTesla has reportedly paused procurement and production plans for its humanoid robot, Optimus, due to unresolved hardware challenges, according to sources within China's supply chain...\nJapan-based Kawasaki Heavy Industries and Taiwan's Hon Hai Precision Industry (Foxconn) have jointly developed a medical robot based on Kawasaki's Nyokkey service robot that is currently...\nByteDance is recruiting heavily for humanoid robot development as the TikTok parent accelerates its push beyond social media into cutting-edge artificial intelligence (AI) applicat...\nSince US President Donald Trump championed the \"Made in America\" initiative, technological competition between the US and China has intensified, rapidly escalating global geopolitical...\nAt the Automatica 2025 exhibition in Germany, NEURA Robotics introduced its third-generation humanoid robot, the 4NE1 Gen-3, marking a significant step in Europe's evolving robotics...\nThe competition in humanoid robotics is intensifying between the US and China, with several Chinese AI robotics companies emerging strongly amid this contest. Among them, Hangzhou-based...\nMesh Ventures, the early-stage VC firm co-founded by Sam Lam, son of Quanta Computer chairman Barry Lam, is marking its 10th anniversary with a renewed focus on four compute-intensive...\nTBI Motion Technology is betting on humanoid robots to offset declining revenue as geopolitical tensions threaten its China business, which accounts for up to 75% of sales.\nLIPS, a Taiwanese 3D vision technology developer, expects multiple-fold revenue growth this year as it transitions from prototype development to mass production after 12 years of...\nThe global robotics boom, driven by generative AI, is putting Taiwan's hardware-driven supply chain back in focus. But its competitive edge remains constrained by a major weakness:...\nGoogle DeepMind has unveiled Gemini Robotics On-Device, the first cloud-independent robotics model capable of performing complex tasks without internet connectivity. This AI model...\nTech giants like Nvidia are optimistic that the next AI revolution will center around humanoid robots. However, the question remains: when will these robots truly become widespread?...\nIn an exclusive interview with DIGITIMES, Georgia Tech professor Benoit Montreuil — widely known as the architect of the \"Physical Internet\" — laid out a blueprint...",
    "article_url": "https://www.digitimes.com/tag/robotics/00113994.html",
    "source_url": "https://www.digitimes.com/news/a20240801PD208/gan-sic-compound-semiconductor-data-center-robotics.html"
  },
  {
    "date": "2025-07-08",
    "headline": "News tagged management at DIGITIMES",
    "content": "Acer Medical, a smart healthcare subsidiary of Acer Group, has secured market approval from Singapore's Health Science Authority (HSA) for its AI-assisted diagnostic software, VeriOsteo...\nMicrosoft Corp. began job cuts that will impact about 9,000 workers, its second major wave of layoffs this year as it seeks to control costs while ramping up on artificial intelligence...\nTSMC announced important resolutions from the extraordinary general meeting of its subsidiary TSMC Arizona. Rick Cassidy, senior vice president of corporate strategy development and...\nMitac Digital Technology (MDT), a subsidiary of MiTAC Holdings Corporation, has secured a large-scale order from Europe's leading fleet management company, marking a milestone in...\nSafroadu Yeboah-Amankwah, chief strategy officer (CSO) at Intel, is set to depart the company by June 30, marking one of the latest executive changes following Lip-Bu Tan's appointment...\nTaiwan Mobile has achieved significant results in both the consumer and enterprise market segments, thanks to its transformation from merely a telco firm to a tech service provider...\nTaiwan's semiconductor companies are expanding their presence in the worldwide fan motor driver integrated circuit market as foreign competitors retreat. Beyond established player...\nElectronics component manufacturer Jabil has revealed a strategic investment of US$500 million in the US to enhance its customer-facing cloud computing and artificial intelligence...\nTaiwan International Ports Corp. has migrated part of its core \"Taiwan Port Net\" system to Microsoft's Azure cloud platform in Taiwan, marking a significant deployment case for the...\nEdimax approved its fiscal year 2024 financial report and dividend distribution plan at a shareholders' meeting on the 19th. The company also authorized a private placement of common...\nTata Elxsi and Infineon Technologies have signed a Memorandum of Understanding (MoU) to jointly develop electric vehicle (EV) solutions tailored for the Indian market. The collaboration...\nTaiwan-based FineMat Applied Materials held its shareholders' meeting on June 17, approving all proposals and outlining its strategic direction amid increasing competition in China's...",
    "article_url": "https://www.digitimes.com/tag/management/0014356.html",
    "source_url": "https://www.digitimes.com/news/a20240801PD208/gan-sic-compound-semiconductor-data-center-robotics.html"
  },
  {
    "date": "2025-07-06",
    "headline": "News tagged silicon at DIGITIMES",
    "content": "Apple and Xiaomi are doubling down on efforts to develop in-house 5G baseband chips, joining a race long dominated by tech heavyweights like Qualcomm and MediaTek. Both companies...\nJapanese semiconductor firm Renesas has halted mass production of silicon carbide (SiC) power semiconductors and will now launch new products including microcontroller units (MCU)...\nUS-based silicon carbide (SiC) giant Wolfspeed officially filed for bankruptcy this week following a series of rumors, initiating restructuring proceedings. Industry players in power...\nIndia is exploring two-dimensional (2D) materials as a potential leapfrog in semiconductor technology, sources told CNBC-TV18. Unlike traditional silicon, 2D materials—just...\nThe leading third-generation semiconductor silicon carbide (SiC) supplier, US-based Wolfspeed, has filed for bankruptcy reorganization. Its major creditors recently reached a restructuring...\nWolfspeed, a global leader in silicon carbide technologies, announced on June 30, 2025, that it has made continued progress in executing its previously announced Restructuring Support...\nAs the world shifts toward an \"everything AI\" paradigm, compute demands are rapidly outpacing hardware performance gains, ushering in what industry leaders are calling a golden decade...\nSamsung Electro-Mechanics has started supplying silicon capacitors to Marvell Technology, a leading US integrated circuit (IC) design company. This development marks Samsung Electro-Mechanics's...\nXbox has announced a multi-year strategic partnership with semiconductor company AMD to co-engineer silicon for its next generation of gaming devices through its official YouTube...\nIntel has announced several leadership appointments as part of its strategy to enhance customer relationships and focus more on engineering innovation. Greg Ernst has been named chief...\nGlobal silicon carbide (SiC) wafer shipments hit a record high in 2024, with China driving the surge, according to statistics from Fuji Keizai. Chinese shipments grew 81.9% year-over-year,...\nTaiwan's MPI Corporation, a major producer of probe cards and semiconductor test equipment, said artificial intelligence infrastructure demand is driving capacity utilization to maximum...\nAMD will host its \"Advancing AI 2025\" event on June 13 (Taipei time) in San Jose, California, where CEO Lisa Su and senior executives will unveil the company's latest AI roadmap....",
    "article_url": "https://www.digitimes.com/tag/silicon/001881.html",
    "source_url": "https://www.digitimes.com/news/a20240801PD208/gan-sic-compound-semiconductor-data-center-robotics.html"
  },
  {
    "date": "2025-07-07",
    "headline": "News tagged EMS Watch at DIGITIMES",
    "content": "US President Donald Trump has unveiled a trade agreement with Vietnam that reduces tariffs on Vietnamese exports to the US from 46% to...\nUniversal Scientific Industrial Shanghai (USI), a China-based electronics design and manufacturing company, has completed delivery of...",
    "article_url": "https://www.digitimes.com/tag/ems_watch/00114523.html",
    "source_url": "https://www.digitimes.com/news/a20240801PD208/gan-sic-compound-semiconductor-data-center-robotics.html"
  },
  {
    "date": "2025-06-30",
    "headline": "Vietnam's new crypto law sets global standard for token regulation and licensing",
    "content": "Vietnam has emerged as a leader in global digital asset regulation with the approval of the Law on Digital Technology Industry on June 14, 2025. Taking effect on January 1, 2026, the law ends years of regulatory ambiguity by introducing clear licensing rules, compliance standards, and innovation incentives for the country's rapidly growing crypto market.\nThis nuanced approach enables Vietnam to maintain rigorous control over financial activities while simultaneously fostering growth within sectors such as gaming and entertainment that utilize digital goods without direct financial implications. Online casinos also operate within this increasingly complex digital environment. As platforms that frequently incorporate cryptocurrency for deposits and withdrawals, they sit at the crossroads of financial regulation and digital leisure, prompting new considerations about licensing, consumer protections, and cross-border access. In jurisdictions where restrictions still apply, many users have turned to using VPN services to access top offshore platforms. These sites are popular not just for their accessibility but because they offer thousands of games, fast crypto payouts across multiple coins, and generous promotions such as welcome bonuses, cashback, and free spins, making them a formidable player in the global digital economy.\nThe significance of this legislative development cannot be understated, particularly given Vietnam's prominent position in global cryptocurrency adoption rankings. The nation hosts millions of active cryptocurrency users and facilitates the circulation of billions of dollars in digital assets, all of which previously operated within an uncertain legal environment lacking formal recognition. This regulatory void has now been systematically addressed through the establishment of clear legal definitions and operational parameters for digital assets under civil law.\nThe legislation introduces a crucial taxonomical distinction between two categories of digital assets that fundamentally shapes the regulatory approach. Crypto assets, encompassing tokens with inherent financial functionality, are subject to comprehensive regulatory oversight, including mandatory licensing requirements, maintenance of financial reserves, implementation of identity verification protocols, and adherence to anti-money laundering standards. Conversely, virtual assets, which encompass in-game currencies and other non-financial digital commodities, operate under a more permissive regulatory framework. This nuanced approach enables Vietnam to maintain rigorous control over financial activities while simultaneously fostering growth within sectors such as gaming and entertainment that utilize digital goods without direct financial implications.\nThe law's most transformative requirement mandates that all cryptocurrency exchanges operating within Vietnamese jurisdiction obtain local licensing. These entities must meet capital requirements, maintain a physical presence, and follow security and anti-money laundering standards aligned with global norms. This addresses prior criticism that Vietnam's financial system was vulnerable to money laundering due to regulatory gaps. The government's proactive response demonstrates a clear commitment to establishing a transparent and compliant digital finance sector.\nThe economic implications of this regulatory framework extend far beyond compliance requirements. The legislation is anticipated to stimulate substantial investment by providing startups with a stable legal foundation upon which to develop their operations. Major international cryptocurrency platforms, including established entities such as Coinbase and Binance, may find the Vietnamese market significantly more attractive given the clarity and predictability offered by this structured regulatory environment. The timing of Vietnam's regulatory initiative aligns strategically with increasing digital asset interest throughout Asia, potentially positioning the nation as a regional leader in financial technology innovation.\nThe law's scope encompasses broader digital development objectives through the introduction of comprehensive incentives for companies engaged in advanced technologies, including blockchain, semiconductors, and artificial intelligence. These incentives manifest through various mechanisms, including tax deductions, import duty exemptions, land-use support, and favorable conditions for foreign technical experts. Through these measures, Vietnam seeks to substantially increase the number of domestic technology companies over the forthcoming decade, establishing the foundation for a digitally-driven economic transformation.\nLarge-scale investment opportunities receive particular attention within the legislative framework. Companies committing expenditures exceeding eighty million dollars for data infrastructure development or one hundred sixty million dollars for semiconductor production may qualify for additional tax relief and enhanced access to skilled workforce resources. These incentives are strategically designed to enhance Vietnam's attractiveness to global investors seeking a stable and progressive operational base within Southeast Asia.\nWhile the legislation sets the core regulatory framework, it leaves room for the government to refine key details during the transition period. Upcoming sub-decrees will clarify rules on DeFi, stablecoins, digital asset taxation, and enforcement. These next steps will be vital in shaping the effectiveness and competitiveness of Vietnam's digital asset system.\nVietnam's digital asset law marks a transformative shift in fintech regulation, offering legal recognition, stricter compliance, and strong business incentives. This forward-looking framework positions the country as a leader in digital economic development and a potential model for other emerging markets.\nArticle edited by Jack Wu",
    "article_url": "https://www.digitimes.com/news/a20250630PR200.html?chid=9",
    "source_url": "https://www.digitimes.com/news/a20240801PD208/gan-sic-compound-semiconductor-data-center-robotics.html"
  },
  {
    "date": "2025-05-26",
    "headline": "[News] NVIDIA’s New China AI Chip Reportedly Ditches TSMC’s CoWoS, HBM for 30% Price Cut | TrendForce News",
    "content": "TrendForce News operates independently from our research team, curating key semiconductor and tech updates to support timely, informed decisions.\nAfter NVIDIA’s H20 has been restricted by the latest U.S. AI chip export curbs, the U.S. chip giant has been reportedly working on a new chipset targeting the market. According to Reuters, the Blackwell-based chip could debut as early as June and cost over 30% less than the H20.\nReuters points to NVIDIA’s choice of memory and packaging as key reasons for the chip’s lower price. Notably, the new model will reportedly forgo TSMC’s advanced CoWoS packaging. In addition, it is expected to be based on the RTX Pro 6000D—a server-grade GPU—paired with standard GDDR7 memory rather than the more expensive HBM, the report adds.\nCheaper than Huawei’s Ascend 910B?\nReuters estimates the new GPU will be priced between $6,500 and $8,000—significantly lower than the H20’s $10,000 to $12,000 range. Another report from South Korean media outlet News Pim suggests that it is even cheaper than Huawei’s Ascend 910B.\nAccording to News Pim, NVIDIA’s upcoming lower-spec “H20 Lite” is drawing attention for its strong appeal to local companies in China. The report notes that though it delivers about 65% of the H20’s performance, it still packs enough power to run large language models. The chip swaps out costly HBM for more affordable GDDR7 memory, which should still handle long text processing tasks, it adds.\nNVIDIA CEO Jensen Huang said last week at the sidelines of COMPUTEX 2025 that the older Hopper architecture—used in the H20—can no longer be modified to meet current U.S. export rules.\nAn NVIDIA spokesperson cited by Reuters said the company is still weighing its “limited” options. Without finalizing a new product design and securing U.S. government approval, NVIDIA is effectively barred from accessing China’s $50 billion data center market, the spokesperson said.\nAnother Custom Chip in the Works?\nIt is worth noting that in addition to the product, NVIDIA is also working on another Blackwell-based chip for China, with mass production likely to begin as early as September, though its specs remain unclear, as per Reuters.\nJensen Huang revealed last week that how U.S. chip export controls have hammered the AI chip giant’s position in China. Once commanding 95% of the Chinese market four years ago, NVIDIA now holds just 50%, with local rivals rushing in to take the rest, according to Reuters.\nNVIDIA is set to announce its Q1 FY26 earnings report on May 28th, likely shedding more light on U.S. export curbs and its new chip in development. As per CNBC, The H20 ban hit NVIDIA hard—forcing a $5.5 billion inventory write-off. CEO Jensen Huang also revealed that the company had to give up $15 billion in potential sales, the report says.\nRead more\n(Photo credit: NVIDIA)",
    "article_url": "https://www.trendforce.com/news/2025/05/26/news-nvidias-new-china-ai-chip-reportedly-ditches-tsmcs-cowos-hbm-for-30-price-cut/",
    "source_url": "https://www.trendforce.com/news/2025/07/03/news-tsmc-to-exit-gan-production-by-july-2027-reportedly-repurposes-fab-for-advanced-packaging/"
  },
  {
    "date": "2025-06-20",
    "headline": "Semiconductors - TrendForce News",
    "content": "News\nTaiwan's second-largest foundry, UMC, is stepping up its efforts in advanced packaging. According to a report from Commercial Times, sources say the company is considering acquiring the facility of TFT-LCD panel maker HannStar in the Southern Taiwan Science Park, which could be used to develop fut...\nNews\nAs Samsung pushes to accelerate 1c DRAM development and regain ground in the HBM4 race, current leader SK hynix is pulling ahead with custom HBM solutions for tech giants. According to the Korea Economic Daily, its first customized HBM—likely HBM4E—is set to debut in the second half of 2026. ...\nNews\nAccording to Bloomberg, White House crypto and AI czar David Sacks states that China is, at most, two years behind the U.S. in semiconductor design and has become increasingly adept at circumventing U.S. export controls. Sacks warns that the U.S. should be concerned about Huawei’s rapid progres...\nNews\nWith hopes of turning the tide in the HBM4 era resting on its progress in 1c DRAM, Samsung has reportedly made a major leap in yield rates. According to Sedaily, the company recently achieved yields of 50–70% in tests for its sixth-generation 10nm-class DRAM (1c DRAM) wafers—a jump from the sub-...\nNews\nHailed as a homegrown alternative to NVIDIA, China’s Moore Threads has completed its IPO guidance, marking a key step toward a public listing, according to Chinese media outlets MyDrivers and IT Home. As per IT Home, the Beijing-based GPU maker filed for a domestic IPO in November 2024. It is w...",
    "article_url": "https://www.trendforce.com/news/category/semiconductors/",
    "source_url": "https://www.trendforce.com/news/2025/07/03/news-tsmc-to-exit-gan-production-by-july-2027-reportedly-repurposes-fab-for-advanced-packaging/"
  },
  {
    "date": "2025-07-03",
    "headline": "[News] Intel Reportedly Considering Dropping Glass Substrate Project, Eyes External Sourcing | TrendForce News",
    "content": "TrendForce News operates independently from our research team, curating key semiconductor and tech updates to support timely, informed decisions.\nAmid speculation that Intel may halt promotion of its 18A process to foundry customers, another initiative is reportedly under review. According to Wccftech, citing German outlet ComputerBase, industry sources suggest that Intel is considering abandoning its glass substrate efforts.\nAs noted by ComputerBase, Intel initially aimed to take a leading role in the glass substrate field, planning to handle much of the development in-house. However, the company is now reportedly shifting toward external sourcing to better focus on core areas such as CPUs and manufacturing.\nWith Intel planning to source glass substrates from third-party suppliers, ComputerBase points out that it remains unclear how much of the development the company will continue to handle internally. This strategy is expected to accelerate product availability, reduce Intel’s overall risk exposure, and provide greater flexibility in supplier selection, as ComputerBase notes.\nFor the broader glass substrate sector, ComputerBase notes that South Korean companies are taking the lead. According to The Korea Herald, the first firm expected to commercialize glass substrates might be Absolics, a semiconductor materials subsidiary of SKC.\nMeanwhile, Samsung Electro-Mechanics, which announced its entry into the market last year, has reportedly begun operating a pilot production line at its Sejong facility. As per The Korea Herald, citing industry sources, Samsung will use glass substrate interposers for its advanced semiconductors by 2028 to better meet customer demands.\nIntel May Shift Foundry Focus from 18A to 14A for New Clients\nBeyond its reported move away from glass substrate development, Intel is also said to be planning another major shift. According to Reuters, the company is considering replacing its 18A node with the next-generation 14A process for new foundry clients, where it believes it can gain a competitive edge over TSMC.\nHowever, as Wccftech notes, despite Intel’s confidence in 14A, making the node available to external customers would still require the company to secure substantial demand from external clients.\nMeanwhile, Wccftech also reports that Intel may continue using 18A for its internal products, such as Panther Lake and Clearwater Forest. Still, the prospects for wider market adoption of 18A appear to be fading.\nReuters further notes, citing sources, that Intel will continue producing chips on the 18A node where plans are already underway. This includes a relatively small volume of chips committed to Amazon and Microsoft, Reuters adds.\nRead more\n(Photo credit: Intel)",
    "article_url": "https://www.trendforce.com/news/2025/07/03/news-intel-reportedly-considering-dropping-glass-substrate-project-eyes-external-sourcing/",
    "source_url": "https://www.trendforce.com/news/2025/07/03/news-tsmc-to-exit-gan-production-by-july-2027-reportedly-repurposes-fab-for-advanced-packaging/"
  },
  {
    "date": "2025-02-24",
    "headline": "TrendForce News",
    "content": "News\nIn recent years, India has been actively promoting the development of its semiconductor industry, with third-generation semiconductors, represented by silicon carbide (SiC) and gallium nitride (GaN), receiving significant attention. According to recent foreign media reports, India’s Minister of...\nNews\nOn January 14, U.S. RF manufacturer MACOM announced plans to invest USD 345 million (approximately 2.528 billion RMB) to comprehensively upgrade its semiconductor wafer manufacturing facilities in Massachusetts and North Carolina. Specifically, the company’s Massachusetts facility will expand i...\nNews\nFollowing the acceptance of the IPO application by Tianyu Semiconductor on the main board of the Hong Kong Stock Exchange (HKEX) on December 23, 2024, two other Chinese third-generation semiconductor companies, Innoscience and SICC, have also made moves towards listing on the Hong Kong market. Among...\nNews\nDriven by downstream applications such as new energy, 5G, and photovoltaics, the third-generation semiconductor industry, represented by silicon carbide (SiC) and gallium nitride (GaN), is rapidly developing. Major semiconductor manufacturers are actively expanding their presence in this sector. At ...\nSponsored Content\nAs two representative materials of wide-bandgap semiconductors, gallium nitride (GaN) currently thrives in the fast charging sector of consumer electronics, while silicon carbide (SiC) is gradually gaining ground in the application scenarios of new energy vehicles. Simultaneously, both are expanding...",
    "article_url": "https://www.trendforce.com/news/tag/gan/",
    "source_url": "https://www.trendforce.com/news/2025/07/03/news-tsmc-to-exit-gan-production-by-july-2027-reportedly-repurposes-fab-for-advanced-packaging/"
  },
  {
    "date": "2025-06-20",
    "headline": "Semiconductors - TrendForce News",
    "content": "News\nTaiwan's second-largest foundry, UMC, is stepping up its efforts in advanced packaging. According to a report from Commercial Times, sources say the company is considering acquiring the facility of TFT-LCD panel maker HannStar in the Southern Taiwan Science Park, which could be used to develop fut...\nNews\nAs Samsung pushes to accelerate 1c DRAM development and regain ground in the HBM4 race, current leader SK hynix is pulling ahead with custom HBM solutions for tech giants. According to the Korea Economic Daily, its first customized HBM—likely HBM4E—is set to debut in the second half of 2026. ...\nNews\nAccording to Bloomberg, White House crypto and AI czar David Sacks states that China is, at most, two years behind the U.S. in semiconductor design and has become increasingly adept at circumventing U.S. export controls. Sacks warns that the U.S. should be concerned about Huawei’s rapid progres...\nNews\nWith hopes of turning the tide in the HBM4 era resting on its progress in 1c DRAM, Samsung has reportedly made a major leap in yield rates. According to Sedaily, the company recently achieved yields of 50–70% in tests for its sixth-generation 10nm-class DRAM (1c DRAM) wafers—a jump from the sub-...\nNews\nHailed as a homegrown alternative to NVIDIA, China’s Moore Threads has completed its IPO guidance, marking a key step toward a public listing, according to Chinese media outlets MyDrivers and IT Home. As per IT Home, the Beijing-based GPU maker filed for a domestic IPO in November 2024. It is w...",
    "article_url": "https://www.trendforce.com/news/category/semiconductors",
    "source_url": "https://www.trendforce.com/news/2025/07/03/news-tsmc-to-exit-gan-production-by-july-2027-reportedly-repurposes-fab-for-advanced-packaging/"
  },
  {
    "date": "",
    "headline": "Energy and Power",
    "content": "電気自動車（EV）充電インフラ市場、252億ドルで大幅成長 Wind Turbine Automation Market Significant Revenue at 43.9 Bn Crecimiento de los ingresos del mercado de IA solar: 4.689 millones 民生用ドローン向けリチウムイオン電池市場、売上高6億7,710万ドル Energy Trading Platform Market Exponential Growth at 14.2% Solar AI Market Significant Growth By 4,689 Million Page 1 Page 2 Page 3 Go to Next Page »",
    "article_url": "https://scoop.market.us/category/energy-power/",
    "source_url": "https://scoop.market.us/sic-and-gan-power-semiconductor-market-news/"
  },
  {
    "date": "",
    "headline": "E-scooter Rental Apps Market Significant Growth at 21.70%",
    "content": "AI Marine Market Light Weapons Market 航空宇宙AI市場 Aircraft Insurance Market スマート空港市場 Aircraft Seat Actuation Systems Market Maritime Surveillance Market Mantenimiento predictivo en el mercado marítimo Aviation MRO Market Maritime Information Market",
    "article_url": "https://scoop.market.us/e-scooter-rental-apps-market-news/",
    "source_url": "https://scoop.market.us/sic-and-gan-power-semiconductor-market-news/"
  },
  {
    "date": "",
    "headline": "ドローンタクシー市場の成長率は13.5%",
    "content": "AI Marine Market Light Weapons Market 航空宇宙AI市場 Aircraft Insurance Market スマート空港市場 Aircraft Seat Actuation Systems Market Maritime Surveillance Market Mantenimiento predictivo en el mercado marítimo Aviation MRO Market Maritime Information Market",
    "article_url": "https://scoop.market.us/%e3%83%89%e3%83%ad%e3%83%bc%e3%83%b3%e3%82%bf%e3%82%af%e3%82%b7%e3%83%bc%e5%b8%82%e5%a0%b4%e3%83%8b%e3%83%a5%e3%83%bc%e3%82%b9/",
    "source_url": "https://scoop.market.us/sic-and-gan-power-semiconductor-market-news/"
  },
  {
    "date": "",
    "headline": "Featured on",
    "content": "Cloud Security Statistics",
    "article_url": "https://scoop.market.us",
    "source_url": "https://scoop.market.us/sic-and-gan-power-semiconductor-market-news/"
  },
  {
    "date": "",
    "headline": "Transportation, Logistics and Supply Chain",
    "content": "Mercado de gemelos digitales de la cadena de suministro: crecimiento significativo del 12,0 % 越境EC物流市場の成長率は26.10% Inventory Trackers Market Growth Impact By 12.3% Se prevén ingresos del mercado de seguridad de la cadena de suministro de 5.400 millones Cargo Insurance Market Exhibits Growth at 65,405.6 Mn Last Mile in E-Commerce Delivery Market Reflects Growth at 9.20% Page 1 Page 2 Page 3 Interim pages omitted … Page 6 Go to Next Page »",
    "article_url": "https://scoop.market.us/category/transportation-logistics-and-supply-chain/",
    "source_url": "https://scoop.market.us/sic-and-gan-power-semiconductor-market-news/"
  },
  {
    "date": "July 7, 2025",
    "headline": "Cornell Chronicle",
    "content": "Research at risk Research at risk: fast delivery of blood transfusions, supplies for troops July 7, 2025 Cornell researchers have been building decision-support tools, optimization methods and artificial intelligence approaches to help the U.S. Navy and Marines quickly and effectively transport people and supplies – including blood for transfusions – in the event of an overseas conflict or humanitarian disaster. Research at risk: after-school nutrition and career readiness for NYC middle-schoolers July 2, 2025 Funding has been cut short for a national program to help young people feed themselves and their families nutritiously. Research at risk: Stopping metastatic cancer June 23, 2025 Weill Cornell Medicine researcher Nancy Du received a $500,000 grant from the Congressionally Directed Medical Research Programs at the U.S. Department of Defense, but a stop-work order brought her research to a halt in April. Research at risk: Records of enslaved people seeking freedom June 16, 2025 A research project collecting records of freedom-seeking enslaved people in the pre-Civil War U.S. came to a halt when researchers received a stop-work order from the National Endowment for the Humanities in early May. Research at risk: Breaking down barriers for autistic job seekers June 9, 2025 A project examining how to help companies hire neurodivergent people has received a termination order, halting work that could have helped autistic people find jobs and employers find talent. Research at risk: Better testing for tick-borne diseases June 4, 2025 Unlike some current tests, new testing could provide results even before symptoms occur – and even for unknown diseases. Research at risk: optimizing the US military’s nutritional ‘secret weapon’ May 29, 2025 A stop-work order imperils research that might enable U.S. active military members to benefit from better nutrition. Research at risk: Building our future in space May 19, 2025 A simulator - with real, hovering spacecraft - would have allowed researchers, companies and government agencies to test crucial space technologies, but a stop-work order from the federal government has halted construction. Research at risk: Keeping Navy divers safe with robot partners May 15, 2025 Cornell researchers are working to understand how robots can assist humans in dangerous and physically challenging environments, but the project, which is funded by the U.S. Department of Defense, has been halted by a stop-work order. Pagination Current page 1 Page 2 Next page » Last page Last »",
    "article_url": "https://news.cornell.edu/categories/researchatrisk",
    "source_url": "https://news.cornell.edu/stories/2024/09/theres-two-sides-semiconductor-and-many-simultaneous-functions"
  },
  {
    "date": "August 22, 2024",
    "headline": "Cornell Chronicle",
    "content": "Freedom of Expression Committee to recommend final expressive activity policy August 22, 2024 The committee of faculty members, students and staff is in the process of reviewing the university’s interim expressive activity policy and will recommend a final policy early in the fall semester. Global Scholars amplify free expression May 13, 2024 The first-ever group of Undergraduate Global Scholars at the Mario Einaudi Center for International Studies are writers, artists and researchers with a common goal – to speak up for global free speech. Around Cornell Speaker: Content moderation is free speech, not censorship May 7, 2024 In her decade researching the topic, Kate Starbird, has witnessed the spread of unintentional misinformation and the growth of deceptive, organized disinformation campaigns that have metastasized throughout social media platforms. Freedom of Expression-themed dinners focus on choice May 2, 2024 “Botticelli’s Banquet,” an Italian Renaissance-themed dinner held April 23 in Keeton House, featured Tuscan-inspired ingredients and a customizable, house-made pizza – evoking the period’s newfound freedom of expression. Expert defends free speech rights, ‘content neutral’ policies May 1, 2024 Former ACLU president Nadine Strossen discussed First Amendment issues with Provost Michael I. Kotlikoff and a panel of student leaders on April 29 in Willard Straight Hall. Freedom of Expression debates reflect civil discourse April 30, 2024 Four events and several contentious issues later, the series modeled meaningful exchange, says Senior Associate Dean Ariel Avgar. Around Cornell Defying the Odds: Elja Sharifi’s Voice for the Powerless April 29, 2024 Afghan visual artist Elja Sharifi, currently a visiting scholar at the Herbert F. Johnson Museum of Art, sees her escape from the Taliban as a call to action. She will enter Cornell’s PhD program in art history next fall. Around Cornell Paying a price to speak out, dissident writers help preserve freedoms April 24, 2024 Speakers at “Dissident Writers: A Conversation” explored how writers keep freedoms open for others by taking risks to criticize governments or societies in environments where there is a cost. Tea ice cream scoops Freedom of Expression competition April 23, 2024 A team of mostly first-year students created Brewing CommuniTea, an Earl Grey tea ice cream with caramel swirls and buttery shortbread pieces inspired by Cornell’s theme year. Pagination Current page 1 Page 2 Page 3 Page 4 Page 5 Page 6 Page 7 Next page » Last page Last »",
    "article_url": "https://news.cornell.edu/categories/freedom-expression",
    "source_url": "https://news.cornell.edu/stories/2024/09/theres-two-sides-semiconductor-and-many-simultaneous-functions"
  },
  {
    "date": "",
    "headline": "Cornell Chronicle",
    "content": "Web Accessibility Assistance Cornell University is committed to making our websites accessible to everyone, including individuals with disabilities. To report a problem or to request an accommodation to access online materials, information, resources, and/or services, please contact ur-accessibility@cornell.edu . In your message, include the website address or URL and the specific problems you have encountered. You will receive a reply as soon as possible.",
    "article_url": "http://news.cornell.edu/web-accessibility-assistance",
    "source_url": "https://news.cornell.edu/stories/2024/09/theres-two-sides-semiconductor-and-many-simultaneous-functions"
  }
]